{ "results": [
	{
        "DREAM_MEANING": "Buses in our dreams have more than one meaning depending if your driving, miss or get hit by a buss. (More details in entry)",
        "DREAM_TERM": "bus",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:11:25.654Z",
        "objectId": "02sximZyl0",
        "updatedAt": "2015-09-19T07:11:52.987Z"
    },
	{
        "DREAM_MEANING": "Dreams of jealousy indicate precisely the same feelings in your waking life. You do not realize it but you are actual jealous of someone and the dream is releasing it. You have some problem in believing in yourself and loving who you are. The dream could also be telling you that you are allowing this negativity to affect intimacy.",
        "DREAM_TERM": "jealousy",
        "createdAt": "2015-09-19T22:40:47.270Z",
        "objectId": "06prmBTBoA",
        "updatedAt": "2015-09-19T22:40:52.849Z"
    },
	{
        "DREAM_MEANING": "A dream of a kitten is symbolic of change and taking steps towards being on your own. On the other hand a kitten represents virtuous qualities.",
        "DREAM_TERM": "kitten",
        "createdAt": "2015-09-19T22:52:19.866Z",
        "objectId": "0IPfYwPVvR",
        "updatedAt": "2015-09-19T22:52:31.390Z"
    },
	{
        "DREAM_MEANING": "A gap means a lost or missing space in something. When you dream of a gap it symbolizes precisely the same thing in your waking life. You may feel like if you are missing something or simply missing the point of a specific case.",
        "DREAM_TERM": "Gap",
        "createdAt": "2015-09-25T15:41:57.614Z",
        "objectId": "0RRv462gN0",
        "updatedAt": "2015-09-25T15:57:21.596Z"
    },
	{
        "DREAM_MEANING": "A dream of an ice pick is symbolic of cold feelings towards sex or just repression of your anger.",
        "DREAM_TERM": "ice pick",
        "createdAt": "2015-09-19T22:27:59.357Z",
        "objectId": "0WgaDx5MZF",
        "updatedAt": "2015-09-19T22:28:13.406Z"
    },
	{
        "DREAM_MEANING": "If you dream that you are part of the game, it symbolizes that you are powerless and others have command over your actions in life. Having a dream where you are engulfed in a video games signifies how you handle things in your waking life. Are you winning the game or losing? What type of game are you playing? If you are winning the game it suggests that you are capable of easily getting out of a situation, instead of going face to face with it. On the other hand, if you are losing the game it indicates that you are having trouble sorting out things in your life.",
        "DREAM_TERM": "video game",
        "createdAt": "2015-09-20T03:54:26.218Z",
        "objectId": "0aG86e2J5P",
        "updatedAt": "2015-09-20T03:54:29.668Z"
    },
	{
        "DREAM_MEANING": "Dreaming of something happening in the night indicates that you are going to experience a period of darkness per say. Some bad things are going to come your way and postpone your success. You need to try and get rid of things that are bringing you down. On the other hand, the night could represents darkness which denotes death, if you see the sun rising it suggest that you are going to see the light and make a fresh start.",
        "DREAM_TERM": "night",
        "createdAt": "2015-09-20T00:06:33.257Z",
        "objectId": "0h6HnASSyo",
        "updatedAt": "2015-09-20T00:06:42.567Z"
    },
	{
        "DREAM_MEANING": "When in debt in a dream it may symbolize anxiety and stress in some area of your life.  Whether it is personal or something to do with business, dreaming of debt means that something is causing you to struggle and worry.",
        "DREAM_TERM": "debts",
        "createdAt": "2015-09-19T07:25:56.576Z",
        "objectId": "0lGrLgDu9S",
        "updatedAt": "2015-09-19T07:25:59.169Z"
    },
	{
        "DREAM_MEANING": "A dream of you working on a farm suggests that you want to go further with your skills, you know what you are about and you want to put them into play. If you just see a farm then you want to get more connected with Mother Nature. Otherwise if you cannot handle the farm and you feel uncomfortable it means you need to me more comfortable with yourself.",
        "DREAM_TERM": "Farm",
        "createdAt": "2015-09-25T15:41:22.517Z",
        "objectId": "0mPiUFmNfa",
        "updatedAt": "2015-09-25T15:51:40.581Z"
    },
	{
        "DREAM_MEANING": "Embarrassment in your dream is symbolic of your insecurities about yourself. A common dream of embarrassment is being naked in public. This dream could mean that you have been exposed whether it is your sexuality or you finally see how people see you.",
        "DREAM_TERM": "Embarassment",
        "createdAt": "2015-09-25T15:37:12.909Z",
        "objectId": "0mRRmR8U0z",
        "updatedAt": "2015-09-25T15:46:13.537Z"
    },
	{
        "DREAM_MEANING": "A shady dream can be a disguise or mask for many things but usually signifies fractions of yourself that are a mystery to you, just something you ignored or failure in some project. (More details in entry)",
        "DREAM_TERM": "darkness",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:24:12.620Z",
        "objectId": "0w2Vw9uBay",
        "updatedAt": "2015-09-19T07:24:37.304Z"
    },
	{
        "DREAM_MEANING": "Your unconscious is warning you about something that may easily become overbearing and cause you to forget everything else that matters. This obsession in your dream implies that if you are not careful it could be reality. So you need to deal with whatever problem before it gets out of control.",
        "DREAM_TERM": "obsession",
        "createdAt": "2015-09-20T00:10:40.952Z",
        "objectId": "1800tzTbWI",
        "updatedAt": "2015-09-20T00:10:43.075Z"
    },
	{
        "DREAM_MEANING": "Your unconscious uses images to relate things. When you dream of an espresso you are actually being told to act quickly and take the express on life. It could also mean express yourself and act on your desire to be more sociable.",
        "DREAM_TERM": "Espresso",
        "createdAt": "2015-09-25T15:38:38.830Z",
        "objectId": "19baSB0YRZ",
        "updatedAt": "2015-09-25T15:47:42.855Z"
    },
	{
        "DREAM_MEANING": "Acting in your dream symbolizes that you are not being yourself in front of people.",
        "DREAM_TERM": "acting",
        "createdAt": "2015-09-19T06:42:59.973Z",
        "objectId": "1BNWZBCtrI",
        "updatedAt": "2015-09-19T06:43:02.253Z"
    },
	{
        "DREAM_MEANING": "Lace is a very sensual material. When you dream of it, it represents your desire to be more sexual and express your feminine side.",
        "DREAM_TERM": "lace",
        "createdAt": "2015-09-19T22:54:09.209Z",
        "objectId": "1SUtouVbYI",
        "updatedAt": "2015-09-19T22:54:11.640Z"
    },
	{
        "DREAM_MEANING": "Bridges in your dreams are an important symbol that you should not ignore.  Dreaming of Bridges let us know that your are in a important transitional period in your life right now.",
        "DREAM_TERM": "bridges",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:10:18.569Z",
        "objectId": "1gWNvLitHS",
        "updatedAt": "2015-09-19T07:10:22.663Z"
    },
	{
        "DREAM_MEANING": "If you dream of a feather it means you need to ease up a bit. Stop being so harsh with things and enjoy life for a bit. If you dream of bird or chicken feathers it indicates you want to get away from a situation which is causing you to be agitated. If the feathers are falling on you from above especially from an eagle be prepared to go further and farther in life because it represents advancement.",
        "DREAM_TERM": "Feather",
        "createdAt": "2015-09-25T15:41:33.440Z",
        "objectId": "1mOveIRVxn",
        "updatedAt": "2015-09-25T15:52:52.819Z"
    },
	{
        "DREAM_MEANING": "A dream of a hallway signifies a journey of self. You are trying to organize your life and transforming in many ways. If it is a hallway that seems to be never ending then you feel stuck in a situation and you do not know how to get out.",
        "DREAM_TERM": "Hallway",
        "createdAt": "2015-09-25T15:42:50.598Z",
        "objectId": "2JXEGxBquW",
        "updatedAt": "2015-09-25T16:00:20.807Z"
    },
	{
        "DREAM_MEANING": "Things left in a garage are neglected and put aside because they are not being used. When you dream of being in a garage it means that you are not applying yourself to the best of your abilities and because of this, you are not heading the right way in life. You need to stop being lazy and go out and be productive.\n\nIf you are opening the garage or entering a garage then you are sure about something. You know what you want and you've decided to take the right steps in order to get where you want to go. Otherwise if the door is closing then you are holding yourself back and being indecisive. Remember friends would carry astray and never bring you back. Stop playing around and helping others; be a bit selfish if you want to get ahead in life.",
        "DREAM_TERM": "Garage",
        "createdAt": "2015-09-25T15:42:07.672Z",
        "objectId": "2ZB4GofDd8",
        "updatedAt": "2015-09-25T15:57:55.244Z"
    },
	{
        "DREAM_MEANING": "A package in your dream symbolizes hidden or repressed aspects of you. Dreaming of receiving a package suggests you are beginning to recognize certain characteristics and emotions about yourself and your surroundings. If you are offering a package it indicates you like to give other people your responsibilities and burden them with your stresses rather than handling them on your own.",
        "DREAM_TERM": "package",
        "createdAt": "2015-09-20T00:14:50.769Z",
        "objectId": "2swFxJzvoQ",
        "updatedAt": "2015-09-20T00:14:54.587Z"
    },
	{
        "DREAM_MEANING": " Hearing voices in your dream means you need to pay attention and listen to what people have to say. Perhaps the advice people are offering you or comments people are saying are bothering you. Alternatively, listen to the message, your unconscious might be warning you or trying to inform you about something.",
        "DREAM_TERM": "voices",
        "createdAt": "2015-09-20T03:56:16.030Z",
        "objectId": "2swh4s4w6j",
        "updatedAt": "2015-09-20T03:56:18.711Z"
    },
	{
        "DREAM_MEANING": "Consider the metaphors being nailed,getting hammered or hitting the nail on the head this dream could represent either of these puns. Your unconscious is trying to get a message across to you by using nails. If you are hammering nails it indicates you have been enjoying yourself a bit too much lately getting hammered but beware of your consequences. Alternatively, the nail could suggest some sensual connotation or being nailed which indicates getting in trouble for something you did wrong. Then there’s the saying “hitting the nail on the head” which implies that youve figured something out and understood something or someone very well.",
        "DREAM_TERM": "nails",
        "createdAt": "2015-09-20T00:01:23.158Z",
        "objectId": "2vcZTr8yRK",
        "updatedAt": "2015-09-20T00:01:25.266Z"
    },
	{
        "DREAM_MEANING": "Helicopters, in a dream, symbolize your potential and being on the right path of what you want in life. If you are in a helicopter then is suggests that you are not pacing yourself well enough. You seem to be moving at a much faster pace than expected. While it may be for your benefit that you are able to think on a higher level than others it can also be bad in communicating with others.",
        "DREAM_TERM": "Helicopter",
        "createdAt": "2015-09-25T15:43:13.062Z",
        "objectId": "3BE5Wm8UoZ",
        "updatedAt": "2015-09-25T16:02:00.336Z"
    },
	{
        "DREAM_MEANING": "A yacht in your dream indicates wealth, prosperity and contentment. You have found a way to kick back and relax a bit more.\n",
        "DREAM_TERM": "yacht",
        "createdAt": "2015-09-20T04:08:49.904Z",
        "objectId": "3DwDxzWkB7",
        "updatedAt": "2015-09-20T04:08:58.917Z"
    },
	{
        "DREAM_MEANING": "Keys are very important dream symbolizes. Think about what its use in the dream is and how it relates to your life. Ultimately a key represents the ability to open and discover a number of things. If you locate a key or keys it means you know how to resolve a situation.",
        "DREAM_TERM": "keys",
        "createdAt": "2015-09-19T22:50:15.436Z",
        "objectId": "3Gtc9yY8g7",
        "updatedAt": "2015-09-19T22:50:20.359Z"
    },
	{
        "DREAM_MEANING": "When we dream of cats in our dreams it represents our independent and mysterious nature. What ever problem going on right now in your walking life you are the only one who can figure it out. (More detail in entry)",
        "DREAM_TERM": "cat",
        "createdAt": "2015-09-19T07:16:28.177Z",
        "objectId": "3JVChV2MPy",
        "updatedAt": "2015-09-19T07:16:43.740Z"
    },
	{
        "DREAM_MEANING": "You may be regretting something that has happened in the past. Alternatively it implies that you keep holding on to the past and cannot move on. It is time that you let go and live your life.",
        "DREAM_TERM": "yesterday",
        "createdAt": "2015-09-20T04:11:10.679Z",
        "objectId": "3K4MRj9QZQ",
        "updatedAt": "2015-09-20T04:11:12.372Z"
    },
	{
        "DREAM_MEANING": "The dream of a jacuzzi symbolizes your sex life and means you need to get rid of whatever is causing you discomfort in that area",
        "DREAM_TERM": "jacuzzi",
        "createdAt": "2015-09-19T22:39:40.739Z",
        "objectId": "3NilFv5XSy",
        "updatedAt": "2015-09-19T22:39:44.275Z"
    },
	{
        "DREAM_MEANING": "Dreaming of an Accident in your dream is quite an important dream symbol.  You must pay very close attention to this and remember as much as possible.  Usually when we dream about accidents we are involved in it. ",
        "DREAM_TERM": "accident",
        "createdAt": "2015-09-19T06:41:50.519Z",
        "objectId": "3Pz7a7Tpcg",
        "updatedAt": "2015-09-19T06:42:18.431Z"
    },
	{
        "DREAM_MEANING": "Dreaming that you or someone is ugly signifies characteristics or parts of yourself that you feel turned off by. This could stem from others resenting you.",
        "DREAM_TERM": "ugly",
        "createdAt": "2015-09-20T03:43:46.715Z",
        "objectId": "4BIYUQa9Em",
        "updatedAt": "2015-09-20T03:43:50.572Z"
    },
	{
        "DREAM_MEANING": "When you dream of ears it has something to do with communication and relationships with others. Ears are representative of your ability or inability to hear and listen, when you see one in your dream it indicates that you need to pay more attention to others and how you relate to them.",
        "DREAM_TERM": "Ear",
        "createdAt": "2015-09-25T15:29:01.433Z",
        "objectId": "4CHP8TF4sA",
        "updatedAt": "2015-09-25T15:30:40.840Z"
    },
	{
        "DREAM_MEANING": "A wallet is very personal to someone; it represents their finances and individuality.  If you see an empty wallet it means you need to find an aspect of yourself that you seem to be missing. Otherwise you are just going through money worries.",
        "DREAM_TERM": "wallet",
        "createdAt": "2015-09-20T04:01:57.786Z",
        "objectId": "4JeT0m1yfj",
        "updatedAt": "2015-09-20T04:01:59.610Z"
    },
	{
        "DREAM_MEANING": "A Jack O Lantern present in your dream indicates some form of protection that you have. If you are carving a Jack O’ Lantern, your dream signifies a fake tough exterior.",
        "DREAM_TERM": "jack o' lantern",
        "createdAt": "2015-09-19T22:38:44.230Z",
        "objectId": "4KGFTlk0wt",
        "updatedAt": "2015-09-19T22:38:54.326Z"
    },
	{
        "DREAM_MEANING": "These dreams hold different meanings depending who is doing the attacking. If somebody else is attacking you who might that be?  If its somebody you recognize then that could imply that person may hold anger towards you. If you are attacking someone than you might hold pent up anger at that person and need a release.  If you dont know who the attacker might be then this might have to do with inner conflict.",
        "DREAM_TERM": "attack ",
        "createdAt": "2015-09-19T06:54:37.577Z",
        "objectId": "4sulmgH7al",
        "updatedAt": "2015-09-19T06:54:38.689Z"
    },
	{
        "DREAM_MEANING": "This is an interesting symbol that might imply something is growing out of the ground in a deep and dark place.",
        "DREAM_TERM": "mushroom",
        "createdAt": "2015-09-20T00:00:53.699Z",
        "objectId": "4z4dfcRTmR",
        "updatedAt": "2015-09-20T00:00:55.951Z"
    },
	{
        "DREAM_MEANING": "When you dream of an engine it is important you remember the condition of the engine when you wake up. Whatever is the condition of the engine is the condition of your force and drive to get things done in your life. Dreaming of an engine that needs a service and does not start it means that theres something holding you back to reach your aspiration. When you dream that the engine is smoky or on fire because it blew up means someone has deceived you or your past ways of acting are coming back to haunt you.",
        "DREAM_TERM": "Engine",
        "createdAt": "2015-09-25T15:37:55.726Z",
        "objectId": "56d2b3Bnl8",
        "updatedAt": "2015-09-25T15:47:07.680Z"
    },
	{
        "DREAM_MEANING": "If you dream of having insomnia you need to watch out for the things causing you to be so stressed because it could actually cause insomnia.",
        "DREAM_TERM": "insomnia",
        "createdAt": "2015-09-19T22:37:46.622Z",
        "objectId": "5DJ5fdrfKY",
        "updatedAt": "2015-09-19T22:38:03.347Z"
    },
	{
        "DREAM_MEANING": "A dream of seeing a ferret is not as good sign. It signifies your lack of trust in others. If someone is talking to you about a ferret, if you decode the word into something that is meaningful in your life then try and figure out what it means to you.",
        "DREAM_TERM": "Ferret",
        "createdAt": "2015-09-25T15:41:38.803Z",
        "objectId": "5ODkqrwYKj",
        "updatedAt": "2015-09-25T15:53:19.153Z"
    },
	{
        "DREAM_MEANING": "A ladle symbolizes love. Pay attention to what you are ladling. Dreaming of a ladle represents feeling loved and cared for. If the ladle is broken it indicates depression, hurt and heartache due to love or lack of it.",
        "DREAM_TERM": "ladle",
        "createdAt": "2015-09-19T22:54:44.799Z",
        "objectId": "5adVy5Hpbh",
        "updatedAt": "2015-09-19T22:54:46.800Z"
    },
	{
        "DREAM_MEANING": "Any dream that show symbols of warnings this is something you need to pay attention too.  Why where you warned and by who?  This might be dream symbol you want to investigate because this could be a serious message.",
        "DREAM_TERM": "warning",
        "createdAt": "2015-09-20T04:02:55.507Z",
        "objectId": "5elppz54BF",
        "updatedAt": "2015-09-20T04:02:58.036Z"
    },
	{
        "DREAM_MEANING": "When you dream of playing with a yoyo it implies that you think that it is easy to play with things. Through the ups and downs, you are not worried because you are able to manage.",
        "DREAM_TERM": "yoyo",
        "createdAt": "2015-09-20T04:12:00.981Z",
        "objectId": "5iFznU3Vrv",
        "updatedAt": "2015-09-20T04:12:05.985Z"
    },
	{
        "DREAM_MEANING": "A pen can appear in your dream if you might be forgetting something that might be a bit important to you.  It can also appear in your dreams when there could be an issue with communication in  your life.  What are you writing down and why would it have significance to you in your life right now?  You might want to think of the term coined “the pen is mightier than the sword” because dreams usually work in metaphors.",
        "DREAM_TERM": "pen",
        "createdAt": "2015-09-20T00:18:55.140Z",
        "objectId": "5lTKuOphGe",
        "updatedAt": "2015-09-20T00:18:57.925Z"
    },
	{
        "DREAM_MEANING": "One of the most common dreams people have. If you are free falling, maybe falling through the clouds, and enjoying it means that you are not afraid of changes and are ready to embrace the beauty of it. If it is in water the dream suggests that you have very strong feelings for someone. As the saying goes, You have falling for someone. You could either enjoy the swim or struggle to resurface which means you do not want to go under, you want to reject these emotions.\n\nIf you fall anywhere and you are overcome by fear it signifies insecurity and anxiety about a situation. You may have failed at doing something in your walking life and the dream is letting out your feelings about doing badly. Falling down in a house in a dream indicates you have problems with family life. Falling off a building signifies problems at work. If you dream of falling off of a rock or mountain it means you need to find out who you are because you do not quite understand yourself.",
        "DREAM_TERM": "Falling",
        "createdAt": "2015-09-25T15:40:52.557Z",
        "objectId": "5slHcQ5YxW",
        "updatedAt": "2015-09-25T15:50:09.201Z"
    },
	{
        "DREAM_MEANING": "Dreaming of hearing an echo suggests that you should pay close attention to what the echo is saying because it could be a voice from your unconscious; it is a message being sent to you possibly from higher powers. To hear your very own echo in the dream symbolizes your efforts in helping other but not moving forward. It could also mean that you are remembering past events that you havent overcome as yet.",
        "DREAM_TERM": "Echo",
        "createdAt": "2015-09-25T15:31:18.736Z",
        "objectId": "5v3M1Fx1DN",
        "updatedAt": "2015-09-25T15:32:39.501Z"
    },
	{
        "DREAM_MEANING": "A dream that you are hacking into someones computer suggests that you are trespassing into places, peoples business or situations but it is not your place to do so.\n\nOn the other hand, if others are hacking into your computer it indicates your openness and susceptibility with people. Your unconscious is telling you that people are walking over you and you need to stop letting so many people in because you are weak. You need to learn how to have some faith in yourself and how to put yourself in a place where people cannot take advantage of your insecurities.",
        "DREAM_TERM": "Hacking",
        "createdAt": "2015-09-25T15:42:46.760Z",
        "objectId": "61dR8qwON7",
        "updatedAt": "2015-09-25T16:05:04.814Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a building symbolizes your life and your inner self. According to famous dream analysts Jung and Freud suggests the building is us and what is in and around gives us indications of what to look out for.",
        "DREAM_TERM": "building",
        "createdAt": "2015-09-19T07:10:46.739Z",
        "objectId": "61iytPXz4L",
        "updatedAt": "2015-09-19T07:10:49.702Z"
    },
	{
        "DREAM_MEANING": "Dreaming in another dream could be very confusing and flustering. Having a nightmare in a dream is even worse. What exactly was the nightmare? You may need to take the bad and turn it into good in your life, turn your nightmares into dreams.",
        "DREAM_TERM": "nightmare",
        "createdAt": "2015-09-20T00:07:04.257Z",
        "objectId": "67vlQXniQB",
        "updatedAt": "2015-09-20T00:07:06.292Z"
    },
	{
        "DREAM_MEANING": " Are you questioning you’re existence in life? Do you feel like you a have sinned and need to confess.  According to Freud he said it symbolizes a woman.",
        "DREAM_TERM": "church",
        "createdAt": "2015-09-19T07:19:00.500Z",
        "objectId": "6EKCtZRmKI",
        "updatedAt": "2015-09-19T07:19:03.660Z"
    },
	{
        "DREAM_MEANING": "Driving a manual car and switching gears in your dream represents your ability to move forward at a steady pace. It could also mean you know how to handle situations and have a good control over things in your life.",
        "DREAM_TERM": "Gear",
        "createdAt": "2015-09-25T15:42:11.885Z",
        "objectId": "6NfrN4Qok1",
        "updatedAt": "2015-09-25T15:58:55.773Z"
    },
	{
        "DREAM_MEANING": "A lady bug in a dream represents fortune, prosperity and attractiveness. On the other hand the dream could just be a metaphor about something annoying or bugging you.",
        "DREAM_TERM": "ladybug",
        "createdAt": "2015-09-19T22:55:02.070Z",
        "objectId": "6OPoQX0MBu",
        "updatedAt": "2015-09-19T22:55:03.793Z"
    },
	{
        "DREAM_MEANING": "If you see or dream of yourself as a zombie it indicates that you are feeling disconnected from the world in some aspect in your life. On the other hand, dreaming of a zombie could simply mean that you feel your life is monotonous and there is nothing that supplies you with any emotions. If you dream of being attacked by zombies it indicates you are afraid something goes out of your control and takes over you.",
        "DREAM_TERM": "zombie",
        "createdAt": "2015-09-20T04:13:35.005Z",
        "objectId": "6kEWeu5nn8",
        "updatedAt": "2015-09-20T04:13:37.374Z"
    },
	{
        "DREAM_MEANING": "Dreaming of being a jedi mean you need to be confident in your mental state, you are in tune with your spirituality and mind. If you see a jedi it signifies your search for harmony and organization in your life.",
        "DREAM_TERM": "jedi",
        "createdAt": "2015-09-19T22:41:16.198Z",
        "objectId": "6oGxvSRFjU",
        "updatedAt": "2015-09-19T22:41:19.858Z"
    },
	{
        "AUTHOR": "Michael",
        "DREAM_MEANING": "When we dream of being “Abstinent” in our dreams means that you are restricting yourself from the daily pleasures in your life.",
        "DREAM_TERM": "abstinence ",
        "createdAt": "2015-09-19T06:34:58.498Z",
        "objectId": "6vVHltVaIx",
        "updatedAt": "2015-09-19T06:37:56.676Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a basement is a very important dream symbol that you should pay close attention too.  A basement represents your deep unconscious mind and instinct.  You have to remember every detail about the basement because it reflects the condition of your unconscious state. See entry for more details.",
        "DREAM_TERM": "basement",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:02:13.461Z",
        "objectId": "6yJlSxVHDO",
        "updatedAt": "2015-09-19T07:04:39.226Z"
    },
	{
        "DREAM_MEANING": "When you see numbers in a dream you need to pay attention to the number and whether its positive or negative. It represents you profits or your losses. On the other hand, numbers signify something very special or important to you. Do you recognise the number(s)? Sometimes a dream of many numbers could be added up to your age. Consider all the possibilities and how they relate to your waking life. If you hear numbers in a consecutive order it suggests that you take things as they come very steadily and an easy pace.",
        "DREAM_TERM": "numbers",
        "createdAt": "2015-09-20T00:08:39.966Z",
        "objectId": "7DIQvn50GS",
        "updatedAt": "2015-09-20T00:08:54.772Z"
    },
	{
        "DREAM_MEANING": "As the saying goes, you are your worst enemy. Your dream could be telling you that you are being too harsh on yourself, take it easy and treat yourself once in a while. If you see someone else as your enemy it could mean different personalities or just simply theres a disagreement and disliking towards or from that person. It could also mean resolving problems you are having with yourself.",
        "DREAM_TERM": "Enemy",
        "createdAt": "2015-09-25T15:37:52.872Z",
        "objectId": "7FBOI0UtP5",
        "updatedAt": "2015-09-25T15:46:59.144Z"
    },
	{
        "DREAM_MEANING": "A dream about Easter is a spiritual dream about happiness and a rebirth. You will turn a new chapter in your life and make good changes.",
        "DREAM_TERM": "Easter",
        "createdAt": "2015-09-25T15:31:13.920Z",
        "objectId": "7PTz0reutg",
        "updatedAt": "2015-09-25T15:31:53.814Z"
    },
	{
        "DREAM_MEANING": "Moths are very similar to butterfly’s and might hold the same translation of transforming. Many say it has to do with psychic abilities.  Moths are at night and has to do with going towards the light.",
        "DREAM_TERM": "moth",
        "createdAt": "2015-09-19T23:59:48.811Z",
        "objectId": "7kk5hDbghA",
        "updatedAt": "2015-09-19T23:59:50.766Z"
    },
	{
        "DREAM_MEANING": "A dream of a knob denotes that you are able to twist and control problems and situations that arise around you.",
        "DREAM_TERM": "knob",
        "createdAt": "2015-09-19T22:53:16.669Z",
        "objectId": "7kubkV3UIY",
        "updatedAt": "2015-09-19T22:53:19.477Z"
    },
	{
        "DREAM_MEANING": "This dream symbol is very positive that imply intellect and hidden talents.  A burning candle might represent the symbol of life.",
        "DREAM_TERM": "candle",
        "createdAt": "2015-09-19T07:12:28.660Z",
        "objectId": "7vlYDsqQKv",
        "updatedAt": "2015-09-19T07:12:30.856Z"
    },
	{
        "DREAM_MEANING": "Dreaming of veins signify your frustration and anger of a situation in your waking life.",
        "DREAM_TERM": "veins",
        "createdAt": "2015-09-20T03:52:35.326Z",
        "objectId": "7ws628nR6n",
        "updatedAt": "2015-09-20T03:52:38.158Z"
    },
	{
        "DREAM_MEANING": "Dreaming of an old item indicates either that your need to throw out your old stuff or you need to dig through your basement or attic and use things from the past to help you in your life now.",
        "DREAM_TERM": "old",
        "createdAt": "2015-09-20T00:12:37.684Z",
        "objectId": "82Ntu0Y7QQ",
        "updatedAt": "2015-09-20T00:12:39.646Z"
    },
	{
        "DREAM_MEANING": "An empty object in your dream symbolizes something is ending and soon would be lost. An empty container could be a hopeful sign to you if you havent used all you have as yet. If you are throwing out things to make a space or an object empty it means you need to clear your mind and start new. If you dream of your car and the gas is running low, it means you are running on low fuel as well. You need to give yourself some spiritual guidance or start eating properly so you can be powerful and give full performance. If you feel empty, you need to pay attention to your body and yourself to fill up that empty void.",
        "DREAM_TERM": "Emptiness",
        "createdAt": "2015-09-25T15:37:38.942Z",
        "objectId": "8LqoAWagj6",
        "updatedAt": "2015-09-25T15:46:40.914Z"
    },
	{
        "DREAM_MEANING": " If you see an unknown person or place in your dream it represents that you want to explore. You want to discover things about yourself and a new place. You may have some connection to the unknown person or place but you would not know unless you ask someone close to you if they know certain people or wants to go somewhere.",
        "DREAM_TERM": "unknown",
        "createdAt": "2015-09-20T03:47:14.408Z",
        "objectId": "8QSD56WiwB",
        "updatedAt": "2015-09-20T03:47:16.414Z"
    },
	{
        "DREAM_MEANING": "Do you consider the vase empty or full? Depending on how you view the vase in your dream dictates the meaning of how you feel about life. If your vase is full then you are happy and content with what life has to offer.",
        "DREAM_TERM": "vase",
        "createdAt": "2015-09-20T03:51:33.431Z",
        "objectId": "8Rc2viwD98",
        "updatedAt": "2015-09-20T03:51:35.184Z"
    },
	{
        "DREAM_MEANING": "When you dream of a unicorn it represents you are going to reach high and not settle for mediocre things in life.",
        "DREAM_TERM": "unicorn",
        "createdAt": "2015-09-20T03:46:54.584Z",
        "objectId": "8foIQ5Y1iF",
        "updatedAt": "2015-09-20T03:46:58.259Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a kayak signifies that you are grounded and stable in terms of your feelings. If not then it represents your perseverance and being able to get through things on your own!",
        "DREAM_TERM": "kayak",
        "createdAt": "2015-09-19T22:49:41.216Z",
        "objectId": "8mZ83XlHtL",
        "updatedAt": "2015-09-19T22:49:45.285Z"
    },
	{
        "DREAM_MEANING": "Did you jump out of an ocean and took a breath of fresh air? This dream is representative of self renewal and a new outlook on things. If you dream that you do not have oxygen or in need of oxygen it implies that you need another method of dealing with things because you feel overwhelmed with things in your life at the moment.",
        "DREAM_TERM": "oxygen",
        "createdAt": "2015-09-20T00:14:27.614Z",
        "objectId": "8xFbpbxZDm",
        "updatedAt": "2015-09-20T00:14:29.865Z"
    },
	{
        "DREAM_MEANING": "Dreaming about kicking someone symbolizes you are kicking someone down which you may not realize in your life. You are attacking that persons reputation or you just feel frustrated with that person.",
        "DREAM_TERM": "kick",
        "createdAt": "2015-09-19T22:50:51.886Z",
        "objectId": "96Z2Jz2sW6",
        "updatedAt": "2015-09-19T22:50:55.153Z"
    },
	{
        "DREAM_MEANING": "If you dream that somebody is aggressive towards you means that somebody in your life is being a bully to you for no reason.  If you are the one who is aggressive implies that you can only let off steam in your dream and not in your walking life. ",
        "DREAM_TERM": "aggression",
        "createdAt": "2015-09-19T06:47:53.822Z",
        "objectId": "9Am2bOxGni",
        "updatedAt": "2015-09-19T06:47:57.781Z"
    },
	{
        "DREAM_MEANING": "To see you feet in a dream is representative of your base and what supports you and your movements. If you are looking at them and paying close attention to flaws you are pondering on your life and what steps to take. Indian people consider the feet to be the most sacred part of the body and so dreaming of the feet are seen as a sign of one of the Gods gracing upon you or giving you like abilities. If your feet are hurt it means that something important to you is going to be damaged or a fault will be found in it. The washing of feet whether it is your own or someone elses is a dream that stands for humility and absolution. Someone may be giving you problems or may have walked over you and you are forgiving them.\nIf you are playing footsie with someone or just tickling their feet it means that a new discovered relationship is going to be very fruitful. You have found a great companion for amazing intimacy and have a similar direction in life.",
        "DREAM_TERM": "Feet",
        "createdAt": "2015-09-25T15:41:36.815Z",
        "objectId": "9KeBtsVodH",
        "updatedAt": "2015-09-25T15:53:04.969Z"
    },
	{
        "DREAM_MEANING": "When you are exposed to venom in your dream, it suggests that you feel poisoned or harmed in some way by another person. Something someone is doing is only causing you harm and forcing bad influences on you.",
        "DREAM_TERM": "venom",
        "createdAt": "2015-09-20T03:52:50.633Z",
        "objectId": "9NMGedvtl3",
        "updatedAt": "2015-09-20T03:52:53.854Z"
    },
	{
        "DREAM_MEANING": "Are you in a need to defend yourself for a battle?  Do you feel you need to feel protected in any way?",
        "DREAM_TERM": "weapon",
        "createdAt": "2015-09-20T04:04:26.790Z",
        "objectId": "9gGepSErku",
        "updatedAt": "2015-09-20T04:04:29.085Z"
    },
	{
        "DREAM_MEANING": " Think of the saying “lend a helping hand.” Dreaming of your palm suggests that you are very helpful to others. If your palms are open it means that you are open to change and to accepting help. If your hands are closed it implies that you are trying to hold on to something or someone, whether it is an attachment or being protective. It could also mean that you are not open to other people and you are not ready to hold someone else’s hand",
        "DREAM_TERM": "palm",
        "createdAt": "2015-09-20T00:16:00.649Z",
        "objectId": "9w1FaQS9l4",
        "updatedAt": "2015-09-20T00:16:03.124Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a necktie symbolizes what you are obliged to do and what keeps you tied down. If the tie is loose then it implies that you have not completed a task. On the other hand, if it is too tight it indicates that you feel stifles in an issue.",
        "DREAM_TERM": "necktie",
        "createdAt": "2015-09-20T00:04:10.056Z",
        "objectId": "9zWoe1SaWd",
        "updatedAt": "2015-09-20T00:04:11.877Z"
    },
	{
        "DREAM_MEANING": "Dreaming of bees in your dreams is  a pleasant dream symbol. In the future you will see money come your way.",
        "DREAM_TERM": "bees",
        "createdAt": "2015-09-19T07:07:17.964Z",
        "objectId": "A4UCkO1ejC",
        "updatedAt": "2015-09-19T07:07:20.734Z"
    },
	{
        "DREAM_MEANING": "What level is the volume in your dream? Usually any sort of volume has to do with your voice and communicating with others. If you dream that the volume is too loud it implies that you are being very influential and trying to shove your thoughts on other people. You need to be a little bit more open and understanding. While turning up the volume indicates that you are not being heard and you are doing everything to make sure that your voice gets across. Unfortunately, you seem to be the only one hearing that voice. Maybe you should try another method of communication?",
        "DREAM_TERM": "volume",
        "createdAt": "2015-09-20T03:57:24.625Z",
        "objectId": "AKr7MbJcy7",
        "updatedAt": "2015-09-20T03:57:26.505Z"
    },
	{
        "DREAM_MEANING": "What objects are you cleaning in you’re dream?  Do you need to clean up your act?  Do you feel dirty or negative in your walking life?  Do you have old habits that you need to change and in the mood for self improvement?",
        "DREAM_TERM": "cleaning",
        "createdAt": "2015-09-19T07:19:26.517Z",
        "objectId": "AQzzAPjPSp",
        "updatedAt": "2015-09-19T07:19:31.220Z"
    },
	{
        "DREAM_MEANING": " A zero is symbolic of a void or emptiness you feel within yourself. It could also mean completeness, do not confuse a zero with a circle which means never ending. You feel that you are getting nowhere in whatever you are pursuing.",
        "DREAM_TERM": "zero",
        "createdAt": "2015-09-20T04:12:48.345Z",
        "objectId": "AcL5kjdKuK",
        "updatedAt": "2015-09-20T04:12:50.192Z"
    },
	{
        "DREAM_MEANING": "Halloween is another important dream symbol. You could be getting an insight into the life after death. You could be reminiscing the past of your childhood days when going and getting candy seemed more exciting. On the other hand you could be longing for excitement in your life. Your unconscious could be informing you of other parts of your soul that you do not realize in your conscious life. Otherwise, it could simply mean that you feel to hide and put on a disguise from rest of society.",
        "DREAM_TERM": "Halloween",
        "createdAt": "2015-09-25T15:42:51.258Z",
        "objectId": "AmTdrWc2wF",
        "updatedAt": "2015-09-25T16:03:39.940Z"
    },
	{
        "DREAM_MEANING": "Dreaming of ice skating signifies your need to take precautions if you want to be successful in your current situation.",
        "DREAM_TERM": "ice skating",
        "createdAt": "2015-09-19T22:29:25.524Z",
        "objectId": "AsN4MooTD8",
        "updatedAt": "2015-09-19T22:29:32.909Z"
    },
	{
        "DREAM_MEANING": "When you dream of demons, it does not necessarily mean that you are possessed. Contrary to what many may think, seeing demons in your dream are a symbol of pessimism, misery or even the evil side of yourself. However, if you are possessed in your dream it is a sign of critical defenselessness.",
        "DREAM_TERM": "demons",
        "createdAt": "2015-09-19T07:27:35.898Z",
        "objectId": "BGQg3zgGrG",
        "updatedAt": "2015-09-19T07:27:37.936Z"
    },
	{
        "DREAM_MEANING": "When you dream of losing your id it symbolizes you losing yourself and who you are. If you see your id then you’ve found out what you want and what you expect in life. You are confident in yourself",
        "DREAM_TERM": "identification",
        "createdAt": "2015-09-19T22:31:29.117Z",
        "objectId": "BMetOJP9XS",
        "updatedAt": "2015-09-19T22:31:43.650Z"
    },
	{
        "DREAM_MEANING": "Do you feel like you are blowing in the wind? Dreams of this nature might suggest you are feeling free like the wind.",
        "DREAM_TERM": "wind",
        "createdAt": "2015-09-20T04:05:52.668Z",
        "objectId": "BbpnIdcVf1",
        "updatedAt": "2015-09-20T04:05:55.555Z"
    },
	{
        "DREAM_MEANING": "If you are being electrocuted in a dream, think of yourself as a bulb that has just been light up. Whatever your new initiative, put it into action! It could change your life in many ways. Witnessing someone else being electrocuted suggests that you are worried about your actions. You feel insecure in your surroundings.",
        "DREAM_TERM": "Electrocution",
        "createdAt": "2015-09-25T15:36:40.501Z",
        "objectId": "Bj9qcOVpDl",
        "updatedAt": "2015-09-25T15:45:02.234Z"
    },
	{
        "DREAM_MEANING": "Weather is an important symbol that can give us insight on how we might be feeling.  Sunny bright days will be positive but storms and rain suggest depression.",
        "DREAM_TERM": "weather",
        "createdAt": "2015-09-20T04:04:40.153Z",
        "objectId": "CawreSayxe",
        "updatedAt": "2015-09-20T04:04:42.221Z"
    },
	{
        "DREAM_MEANING": "Don’t be alarmed when you experience a nightmare like this.  I know it can be scary but there is a positive with this dream.  When you dream about being buried represents our fears are taking over our life.  Get a handle on your emotions and stop stressing.",
        "DREAM_TERM": "buried alive",
        "createdAt": "2015-09-19T07:11:10.632Z",
        "objectId": "CbRkYkficx",
        "updatedAt": "2015-09-19T07:11:12.696Z"
    },
	{
        "DREAM_MEANING": "When you dream about throwing up this signifies that you cannot communicate properly about your feelings in an aspect of your life. On the other hand the dream could be telling you that you are giving out too much information without realizing it and you would pay for it eventually if you do not stop.",
        "DREAM_TERM": "Gag",
        "createdAt": "2015-09-25T15:41:39.558Z",
        "objectId": "CstlFazE6U",
        "updatedAt": "2015-09-25T15:56:43.816Z"
    },
	{
        "DREAM_MEANING": "Could this represent to sides that are not getting along?  Do you have a fear of war breaking out in any aspects in your life? Do you have anger issue?",
        "DREAM_TERM": "war",
        "createdAt": "2015-09-20T04:02:19.948Z",
        "objectId": "CuAseDpxQS",
        "updatedAt": "2015-09-20T04:02:22.966Z"
    },
	{
        "DREAM_MEANING": "When you have a dream of an organized yard it indicates you have this same mentality towards every prospect of your life. If you see a disorganized yard suggests that you do not know how to manage your life.",
        "DREAM_TERM": "yard",
        "createdAt": "2015-09-20T04:09:09.443Z",
        "objectId": "CuuFtlVBGX",
        "updatedAt": "2015-09-20T04:09:11.293Z"
    },
	{
        "DREAM_MEANING": " Dreaming of being a valedictorian indicates that you have been successful in your life and you are reminiscing of these achievements.",
        "DREAM_TERM": "valedictorian",
        "createdAt": "2015-09-20T03:50:00.529Z",
        "objectId": "D61bKKFXbw",
        "updatedAt": "2015-09-20T03:50:02.999Z"
    },
	{
        "DREAM_MEANING": "Dreaming of diving into water means that you want to plunge into something that would please you, if the water is clean it means you have overcome come problems and you feel content.",
        "DREAM_TERM": "diving",
        "createdAt": "2015-09-19T07:30:15.810Z",
        "objectId": "DLj8fwqRMr",
        "updatedAt": "2015-09-19T07:30:17.503Z"
    },
	{
        "DREAM_MEANING": "Seeing your nose in a dream suggests that you are being nosy about a situation. You shouldnt go around poking your nose into matters that do not concern you because you will get yourself into trouble. If your nose is growing in your dream or you see someone elses nose growing it indicates that someone is being dishonest, perhaps you are not being true?",
        "DREAM_TERM": "nose",
        "createdAt": "2015-09-20T00:08:03.908Z",
        "objectId": "DMTvqZhzkw",
        "updatedAt": "2015-09-20T00:08:06.357Z"
    },
	{
        "DREAM_MEANING": "What are you’re cards?  What do the cards mean to you?  The cards could symbolize aspects or characteristics about yourself. ",
        "DREAM_TERM": "cards",
        "createdAt": "2015-09-19T07:16:03.189Z",
        "objectId": "DVn8EtQaIh",
        "updatedAt": "2015-09-19T07:16:05.423Z"
    },
	{
        "AUTHOR": "Michael",
        "DREAM_MEANING": "Depending the context of the dream can mean two different things.  If you are being beaten up means that somebody is taking full control in your life.  If you where actually abused in your life and dream about being abused means that you are still affected by this traumatic event.",
        "DREAM_TERM": "abuse",
        "createdAt": "2015-09-19T06:36:24.531Z",
        "objectId": "Dp0WrSCrx1",
        "updatedAt": "2015-09-19T06:37:50.659Z"
    },
	{
        "DREAM_MEANING": "Different parts of a house have totally different meanings to them.  Dreaming about being in your bedroom represents your secretive side and creative side. ",
        "DREAM_TERM": "bedroom",
        "createdAt": "2015-09-19T07:06:43.873Z",
        "objectId": "DtjU8WPLgu",
        "updatedAt": "2015-09-19T07:07:01.667Z"
    },
	{
        "DREAM_MEANING": "Dreaming of an observatory symbolizes your aims and ambitions.",
        "DREAM_TERM": "observatory",
        "createdAt": "2015-09-20T00:10:26.814Z",
        "objectId": "DtlFGRlXiX",
        "updatedAt": "2015-09-20T00:10:28.960Z"
    },
	{
        "DREAM_MEANING": "Even if you do not believe in karma, the dream represents your relationship with others and whether its positive or negative.",
        "DREAM_TERM": "karma",
        "createdAt": "2015-09-19T22:49:26.063Z",
        "objectId": "E2Lv3X2X5F",
        "updatedAt": "2015-09-19T22:49:29.077Z"
    },
	{
        "DREAM_MEANING": "Dreaming of an ibis represents your ability to strive for your ambitions in life.",
        "DREAM_TERM": "ibis",
        "createdAt": "2015-09-19T22:25:39.525Z",
        "objectId": "EJTHrMf3wX",
        "updatedAt": "2015-09-19T22:25:52.350Z"
    },
	{
        "DREAM_MEANING": "A ladder is a good symbol because it signifies success and accomplishment. Depending on where you are on the ladder would signify what level you are in achieving your goals. It does not need to be in work or school alone it could mean your reputation in society or your outlook of some sort. It simply means you are growing more aware and taking steps on your ladder. A ladder could also represent an increased level or closeness with your spirituality.",
        "DREAM_TERM": "ladder",
        "createdAt": "2015-09-19T22:54:31.761Z",
        "objectId": "ENQkLTShBS",
        "updatedAt": "2015-09-19T22:54:33.913Z"
    },
	{
        "DREAM_MEANING": "Dreaming of being obese, if you are not obese, indicates worry or fear of gaining weight. You are lacking self control and indulging often. On the other hand, if you are actually obese in your waking life, the dream is depicting your situation and inability to become healthy. Are you happy with your image or are you only fooling yourself? Do what you need to do to build up your self esteem and create a healthy approach to life mentally and physically.",
        "DREAM_TERM": "obese",
        "createdAt": "2015-09-20T00:10:10.551Z",
        "objectId": "EfOUaGUyrK",
        "updatedAt": "2015-09-20T00:10:12.734Z"
    },
	{
        "DREAM_MEANING": "Violets are symbolic of love, adoration and happiness. When you receive violets in your dream it is indicative to someone bringing joy to your life. On the other hand, giving violets means that you are a bit shy to express your passion towards someone.",
        "DREAM_TERM": "violets",
        "createdAt": "2015-09-20T03:55:03.724Z",
        "objectId": "Eh4kPtwvPF",
        "updatedAt": "2015-09-20T03:55:06.012Z"
    },
	{
        "DREAM_MEANING": "The dream that you are anxious about things it means that you are uncertain about things.",
        "DREAM_TERM": "nervous",
        "createdAt": "2015-09-20T00:05:44.922Z",
        "objectId": "Eyasi4EDBJ",
        "updatedAt": "2015-09-20T00:05:49.103Z"
    },
	{
        "DREAM_MEANING": "Are you trying to light something? A dream of lighting up something signifies a light bulb of thoughts! If you do not have problem igniting it then you are going to be successful with your idea. If it gives problems igniting then you are going to be unfruitful with the idea.",
        "DREAM_TERM": "ignition",
        "createdAt": "2015-09-19T22:33:01.772Z",
        "objectId": "F0cPSqXD6F",
        "updatedAt": "2015-09-19T22:33:08.359Z"
    },
	{
        "DREAM_MEANING": "Dreams with any form of plastic surgery are because of insecurities with your appearance and body image. You have a dream of a facelift when your confidence level goes up a bit and the insecurities die down for a while.",
        "DREAM_TERM": "Facelift",
        "createdAt": "2015-09-25T15:40:28.363Z",
        "objectId": "F53OVMavSg",
        "updatedAt": "2015-09-25T15:48:32.318Z"
    },
	{
        "DREAM_MEANING": " If you dream that you are missing something, you actually have unfulfilled desires and needs. Try paying attention to what you are yearning for in your dream and relating it to your life. Then fill the empty space in your life.",
        "DREAM_TERM": "yearn",
        "createdAt": "2015-09-20T04:10:33.132Z",
        "objectId": "FcxDyDMEI0",
        "updatedAt": "2015-09-20T04:10:35.556Z"
    },
	{
        "DREAM_MEANING": "Dreaming of adultery means that you have had thoughts and desires of being with another spouse.  This doesn’t mean that you are going to carry out this act.  Believe it or not this is quite common with both men and women who are married.",
        "DREAM_TERM": "adultery",
        "createdAt": "2015-09-19T06:45:16.057Z",
        "objectId": "FfZ0BMvk2f",
        "updatedAt": "2015-09-19T06:45:18.657Z"
    },
	{
        "DREAM_MEANING": "A dead body in your dream is a thought that you have chosen to ignore. If the body comes revives and comes back to life it means that the thought is trying to surface itself in your conscious mind. ",
        "DREAM_TERM": "dead body",
        "createdAt": "2015-09-19T07:25:31.995Z",
        "objectId": "G5xpu3Ujb1",
        "updatedAt": "2015-09-19T07:25:35.320Z"
    },
	{
        "DREAM_MEANING": "Dreaming of seeing a king is a good sign. It represents power, control and achievement. It indicates that you are able to control your issues in life. The king may, on the other hand, signify a fatherly figure that you want in your life to hold you up.\nIf you dream of yourself being a king it means that you are using the power you have gained in too much of a forceful and controlling way.",
        "DREAM_TERM": "king",
        "createdAt": "2015-09-19T22:51:43.798Z",
        "objectId": "GIe83EsDiH",
        "updatedAt": "2015-09-19T22:51:46.875Z"
    },
	{
        "DREAM_MEANING": "A dream of having an illness represents your fears of becoming sick.",
        "DREAM_TERM": "illness",
        "createdAt": "2015-09-19T22:33:58.130Z",
        "objectId": "GPUdFaRFdt",
        "updatedAt": "2015-09-19T22:34:03.157Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a knight indicates you have an admirable reputation. You look out for others and make sure people you care about are safe. If you are helping out a girlfriend or boyfriend it is a metaphor of being their knight in shining armor. If you dream of becoming a knight it represent your new gained trust and respect from others.",
        "DREAM_TERM": "knight",
        "createdAt": "2015-09-19T22:53:04.574Z",
        "objectId": "GgoxRoeyjZ",
        "updatedAt": "2015-09-19T22:53:06.941Z"
    },
	{
        "DREAM_MEANING": "We as humans often tend to forget the small things in life and run for the grand prize. When you dream of being farsighted your unconscious is telling you to stop ignoring the small things and you would find what you are looking for.",
        "DREAM_TERM": "Farsighted",
        "createdAt": "2015-09-25T15:41:24.766Z",
        "objectId": "GlwB0yM0SM",
        "updatedAt": "2015-09-25T15:51:50.852Z"
    },
	{
        "DREAM_MEANING": "A lantern represents enlightenment and a lit spirit. These qualities are admired and are causing you to glow.",
        "DREAM_TERM": "lantern",
        "createdAt": "2015-09-19T22:57:39.144Z",
        "objectId": "GzWz8YLt2b",
        "updatedAt": "2015-09-19T22:57:41.238Z"
    },
	{
        "DREAM_MEANING": "To be an actor or actress in your dream represents a need to enjoy life pleasures.  What type of roll are you playing?  By finding this out will help you find the traits that you are looking for in your life.",
        "DREAM_TERM": "actress",
        "createdAt": "2015-09-19T06:43:51.894Z",
        "objectId": "H0alWeJ0eG",
        "updatedAt": "2015-09-19T06:43:54.920Z"
    },
	{
        "DREAM_MEANING": "Dreaming of nature represents being at peace with society and having an appreciation for the environment.",
        "DREAM_TERM": "nature",
        "createdAt": "2015-09-20T00:03:02.547Z",
        "objectId": "H6AiDOqGru",
        "updatedAt": "2015-09-20T00:03:04.515Z"
    },
	{
        "DREAM_MEANING": "When we see blood in our dream it symbolizes many things like lust, anger and failed ventures. (More details under entry)",
        "DREAM_TERM": "blood",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:08:36.063Z",
        "objectId": "HKWU8CRbIR",
        "updatedAt": "2015-09-19T07:08:52.561Z"
    },
	{
        "DREAM_MEANING": "Putting up wallpaper in a dream, whether you are doing it or someone else is, symbolizes a wall that you have been putting up around you. Perhaps you are using the wall as a shield to conceal some secret. Pay attention to what pattern or color is on the wall paper for further significance. The dream could simply represent you feelings finally being displayed.",
        "DREAM_TERM": "wallpaper",
        "createdAt": "2015-09-20T04:02:10.039Z",
        "objectId": "HNMS5NoGon",
        "updatedAt": "2015-09-20T04:02:12.135Z"
    },
	{
        "DREAM_MEANING": "Dream of this Japanese garment indicates you are liked in some way with the culture or have feelings for someone from the country.",
        "DREAM_TERM": "kimono",
        "createdAt": "2015-09-19T22:51:16.124Z",
        "objectId": "HPysha8QYz",
        "updatedAt": "2015-09-19T22:51:18.249Z"
    },
	{
        "DREAM_MEANING": "Disaster in your dream represents your fear and worry for your future or fear for change. Otherwise, be a bit cautious because it may be a predictive dream and it could happen in your life.",
        "DREAM_TERM": "disaster",
        "createdAt": "2015-09-19T07:29:04.197Z",
        "objectId": "HQ2H7K7Jkc",
        "updatedAt": "2015-09-19T07:29:06.593Z"
    },
	{
        "DREAM_MEANING": "Who and what are you cutting. This could imply you may want to move away from that person or situation.",
        "DREAM_TERM": "cutting",
        "createdAt": "2015-09-19T07:19:52.593Z",
        "objectId": "HhKrcEkVZc",
        "updatedAt": "2015-09-19T07:19:54.269Z"
    },
	{
        "DREAM_MEANING": "Eggs are important symbols that you do not want to forget. They are symbolic of fertility and the artistic side to you. It is common for women to dream of eggs before they find out they are pregnant.",
        "DREAM_TERM": "Eggs",
        "createdAt": "2015-09-25T15:35:40.128Z",
        "objectId": "HvHPOnJshF",
        "updatedAt": "2015-09-25T15:44:22.723Z"
    },
	{
        "DREAM_MEANING": " If you dream about doing magic in front of people means that you are good at tricking people. What type of magic or who is watching you in your dream? The people in the dream would suggest the people that your able to pull the wool over there eyes. Everybody love Magic so you might have some majestic qualities about your personality.",
        "DREAM_TERM": "magic",
        "createdAt": "2015-09-19T23:54:42.604Z",
        "objectId": "ILDahOkbDn",
        "updatedAt": "2015-09-19T23:54:46.035Z"
    },
	{
        "DREAM_MEANING": "If you eat the ice cream and realize it has gone bad suggests bad things in your life and something or someone that appears to be good is really bad and you would not realize until you get trapped in deception.\nIf you see the ice cream melting in your dream it symbolizes dreams and goals that you would not be able to attain",
        "DREAM_TERM": "ice cream",
        "createdAt": "2015-09-19T22:26:47.439Z",
        "objectId": "IU15XUZl0A",
        "updatedAt": "2015-09-19T22:27:19.341Z"
    },
	{
        "DREAM_MEANING": "A dream with a lake represents how you feel. You do not think that you could express your emotions. On the other hand the lake could mean a place where you can clear your mind and feel at ease. The clearer the lake, the clearer your mind and more at peace you are with yourself. If the lake is rough or dirty it indicates emotional distress.",
        "DREAM_TERM": "lake",
        "createdAt": "2015-09-19T22:55:21.710Z",
        "objectId": "IXkbeqIYoA",
        "updatedAt": "2015-09-19T22:55:23.761Z"
    },
	{
        "DREAM_MEANING": "A hammock is symbolic of relaxation and taking things easy. You may need to take some time for yourself and decide what you want in life. If you are lying in the hammock then you need to be careful not to spend too much time alone to get rid of relationships. You should be careful cause if you fall off the hammock then you have been too involved with taking care of others that you feel to guilty to take time for yourself in your waking life.",
        "DREAM_TERM": "Hammock",
        "createdAt": "2015-09-25T15:42:55.042Z",
        "objectId": "Ieoe3uPzaK",
        "updatedAt": "2015-09-25T16:03:09.222Z"
    },
	{
        "DREAM_MEANING": "Ouch… that hurts! You are probably inflicting this pain on yourself! When you dream of being in pain it represents that you are pushing yourself to your limits, give yourself a break! You do not have control over everything. If your body is hurting in a particular place try and relate it to your life, maybe it is actually in pain and you’ve been physically stressing out your body.",
        "DREAM_TERM": "pain",
        "createdAt": "2015-09-20T00:15:26.069Z",
        "objectId": "IwR3ybZtKY",
        "updatedAt": "2015-09-20T00:15:28.058Z"
    },
	{
        "DREAM_MEANING": "If you are bored, it signifies you are bored in your life but it is because you are not applying yourself to do what needs to be done.",
        "DREAM_TERM": "idle",
        "createdAt": "2015-09-19T22:32:12.407Z",
        "objectId": "J4aEyx42WC",
        "updatedAt": "2015-09-19T22:32:16.927Z"
    },
	{
        "DREAM_MEANING": "Dreaming of the undead symbolizes your people or aspects of yourself that you have cut off. If you are being run down by zombies it signifies problems that you just shoved aside and are now coming back to taunt you.",
        "DREAM_TERM": "undead",
        "createdAt": "2015-09-20T03:45:03.558Z",
        "objectId": "J73nnTcwNt",
        "updatedAt": "2015-09-20T03:45:07.342Z"
    },
	{
        "DREAM_MEANING": "When you dream about someone who is a threat to you, the important thing is how you counter or the way you act towards that person. If someone pursues or attacks you it means the person symbolizes a problem which is troubling you. When you flee from a dangerous person you are content that you are able to work out a current problem.",
        "DREAM_TERM": "dangerous person",
        "HAS_ENTRY": false,
        "createdAt": "2015-09-19T07:23:50.405Z",
        "objectId": "J9AYpKLv0o",
        "updatedAt": "2015-09-19T07:33:24.341Z"
    },
	{
        "DREAM_MEANING": "To dream of an oracle, symbolizes your belief of fate. You are seeking some guidance or are expressing a desire to know what the future has in stored for you. The dream also serves to offer reassurance needed for you to move forward and look ahead in a positive direction.",
        "DREAM_TERM": "oracle",
        "createdAt": "2015-09-20T00:13:29.962Z",
        "objectId": "JOuDJh8VPp",
        "updatedAt": "2015-09-20T00:13:31.908Z"
    },
	{
        "DREAM_MEANING": "n our life’s camera play a big role in capturing the past. When you dream of a camera its suggest that you are holding on to the past. ",
        "DREAM_TERM": "camera",
        "createdAt": "2015-09-19T07:12:45.461Z",
        "objectId": "Ji53eX5Hkr",
        "updatedAt": "2015-09-19T07:12:48.094Z"
    },
	{
        "DREAM_MEANING": "If you find yourself yawning in your dream, stop being so lazy and get up! You need to find something that would give you a bit of stimulation mentally, physically and emotionally.",
        "DREAM_TERM": "yawning",
        "createdAt": "2015-09-20T04:09:56.097Z",
        "objectId": "JwLey44XCv",
        "updatedAt": "2015-09-20T04:09:58.324Z"
    },
	{
        "DREAM_MEANING": "Whether you are having a yard sale or you are attending one it means that you learnt from the past and are using those experiences as lessons in your life now.",
        "DREAM_TERM": "yard sale",
        "createdAt": "2015-09-20T04:09:21.917Z",
        "objectId": "Jxrsoqx7O8",
        "updatedAt": "2015-09-20T04:09:23.722Z"
    },
	{
        "DREAM_MEANING": "Dreaming of seeing an idiot or being one suggests that you are over thinking something where not necessary.",
        "DREAM_TERM": "idiot",
        "createdAt": "2015-09-19T22:31:57.236Z",
        "objectId": "Jzw1NrCXsy",
        "updatedAt": "2015-09-19T22:32:02.144Z"
    },
	{
        "DREAM_MEANING": "Seeing a UFO in your dream indicates your yearning about where you are going and what you are destined for in life. Otherwise it represents your feelings of being an outsider.",
        "DREAM_TERM": "UFO",
        "createdAt": "2015-09-20T03:43:23.749Z",
        "objectId": "K782nm2zcm",
        "updatedAt": "2015-09-20T03:43:32.788Z"
    },
	{
        "DREAM_MEANING": "Photos in dreams means special events that happened in your past life.  Who and what was in the picture and why does it hold significance to you.  Do you have trouble letting go of the past?",
        "DREAM_TERM": "photos",
        "createdAt": "2015-09-20T00:19:44.225Z",
        "objectId": "KAkhaR8V5S",
        "updatedAt": "2015-09-20T00:19:46.378Z"
    },
	{
        "AUTHOR": "Michael",
        "DREAM_MEANING": "The dreamer may be putting too much time into something and are feeling overwhelmed.",
        "DREAM_TERM": "absorbed",
        "createdAt": "2015-09-19T06:33:13.612Z",
        "objectId": "KIOdQv1djf",
        "updatedAt": "2015-09-19T06:37:59.478Z"
    },
	{
        "DREAM_MEANING": "Some people are not close with their family and so have friends who they consider family. Family is very important the second most important aspect of a human life as Maslow explained in his hierarchy of needs. Family should provide safety, security and love.\nDreaming of a happy experience with your family represents your actual relationship with your family. You have a good relationship with them in which you feel safe and cared for. If you dream your family is in danger and you are needed, you feel like you are responsible for them. If you have an argument in your dream with someone in your family it means that you are trying to suppress some quality you have from them.\n\nDreams of having a different family than your actual family means you feel more accepted and secure with another set of people.",
        "DREAM_TERM": "Family",
        "createdAt": "2015-09-25T15:41:20.368Z",
        "objectId": "KNhLDcfo3s",
        "updatedAt": "2015-09-25T15:50:14.880Z"
    },
	{
        "DREAM_MEANING": "Why are you hiding or carrying on with a false persona?  When you dream of  being disguised it means you refuse to face reality or come to terms with things in your life.",
        "DREAM_TERM": "disguise",
        "createdAt": "2015-09-19T07:29:52.701Z",
        "objectId": "KPISCnfLnU",
        "updatedAt": "2015-09-19T07:29:58.215Z"
    },
	{
        "DREAM_MEANING": "First of all, was it a nice or rank smell? Whatever ever the smell, tells you what type of memory you are recalling in your dream",
        "DREAM_TERM": "odor",
        "createdAt": "2015-09-20T00:12:06.246Z",
        "objectId": "KPnunSrkrC",
        "updatedAt": "2015-09-20T00:12:08.750Z"
    },
	{
        "DREAM_MEANING": "When ever we dream of being an accomplice in our dreams implies that somebody in your life is bringing you down mentally.",
        "DREAM_TERM": "accomplice",
        "createdAt": "2015-09-19T06:59:09.400Z",
        "objectId": "KSZvKWbnv2",
        "updatedAt": "2015-09-19T06:59:11.757Z"
    },
	{
        "DREAM_MEANING": "What type of vehicle did you dream about? The vehicle in your dream represents the stage at which you have reached in handling your life. On the other hand, if you are not driving the vehicle then someone else has some control over a situation in your waking life. If you are forced out the vehicle for whatever reason, it suggests that you need to stop rushing into things and slow down.",
        "DREAM_TERM": "vehicle",
        "createdAt": "2015-09-20T03:52:16.898Z",
        "objectId": "Kb6pHWRVwr",
        "updatedAt": "2015-09-20T03:52:23.084Z"
    },
	{
        "DREAM_MEANING": " When you see a blank paper in your dream it indicates that you want to come clean and create a new beginning in your life. Alternatively, blank paper indicates that you need to work on being  more communicative.",
        "DREAM_TERM": "paper",
        "createdAt": "2015-09-20T00:17:13.146Z",
        "objectId": "Km6JUyCh7B",
        "updatedAt": "2015-09-20T00:17:14.874Z"
    },
	{
        "DREAM_MEANING": "Could this be a play on words for you being “right”?",
        "DREAM_TERM": "writing",
        "createdAt": "2015-09-20T04:06:50.754Z",
        "objectId": "LIdo9LPmfx",
        "updatedAt": "2015-09-20T04:06:52.842Z"
    },
	{
        "DREAM_MEANING": "So your flying around on a carpet. These dreams fall under a “lucid dream”. Dreams of flying can be quite exhilarating, so just enjoy the rid as long as you can. This is a very positive dream symbol that suggest that you will overcome obstacles.",
        "DREAM_TERM": "magic carpet",
        "createdAt": "2015-09-19T23:55:17.786Z",
        "objectId": "LXjbWwnCp8",
        "updatedAt": "2015-09-19T23:55:21.884Z"
    },
	{
        "DREAM_MEANING": "If you are washing either in a bath, shower or ocean suggests maybe a need for inner cleansing. Do you need to clean up aspects of yourself that you might find dirty or bad.  What parts are you washing?  The area might you are washing might be a metaphor for something that needs to be fixed. If you where washing your hands it could mean innocence.",
        "DREAM_TERM": "washing",
        "createdAt": "2015-09-20T04:03:11.801Z",
        "objectId": "Lap9y4FkV5",
        "updatedAt": "2015-09-20T04:03:14.421Z"
    },
	{
        "DREAM_MEANING": "To watch an opera in your dream, represents your quest for the grander things in life. The dream may also be trying to tell you that you are being overly dramatic in some waking situation.",
        "DREAM_TERM": "opera",
        "createdAt": "2015-09-20T00:13:12.868Z",
        "objectId": "LeIMTMQYTK",
        "updatedAt": "2015-09-20T00:13:15.097Z"
    },
	{
        "DREAM_MEANING": "A dream about a wager signifies a hazardous decision that you are to make in the near future. Some things in life are totally unpredictable.",
        "DREAM_TERM": "wager",
        "createdAt": "2015-09-20T03:59:37.749Z",
        "objectId": "Ln08W5SPeF",
        "updatedAt": "2015-09-20T03:59:40.620Z"
    },
	{
        "DREAM_MEANING": "When you dream of narrow spaces it suggests that you are feeling constricted and struggling with some situation in life. The dream also indicates small-mindedness.",
        "DREAM_TERM": "narrow",
        "createdAt": "2015-09-20T00:02:44.421Z",
        "objectId": "M3xS6eSdGC",
        "updatedAt": "2015-09-20T00:02:46.883Z"
    },
	{
        "DREAM_MEANING": "An umbrella represents protecting your emotions. You do not want to confront your problems and are trying to push them aside.",
        "DREAM_TERM": "umbrella",
        "createdAt": "2015-09-20T03:44:33.681Z",
        "objectId": "MLHMtrGVBc",
        "updatedAt": "2015-09-20T03:44:36.266Z"
    },
	{
        "DREAM_MEANING": "You want approval from others in order for you to progress. The judgment in your dream is one which is required in your life.",
        "DREAM_TERM": "judgement",
        "createdAt": "2015-09-19T22:46:07.619Z",
        "objectId": "MPcMQFoCVC",
        "updatedAt": "2015-09-19T22:46:14.116Z"
    },
	{
        "DREAM_MEANING": "Being unable to speak your mind and not having a voice in your dream symbolizes that you have forgotten who you are and what you are about. The dream indicates that you have lost your strength in being able to stand your ground.",
        "DREAM_TERM": "voiceless",
        "createdAt": "2015-09-20T03:56:05.389Z",
        "objectId": "MXBTmpN1Sx",
        "updatedAt": "2015-09-20T03:56:07.255Z"
    },
	{
        "DREAM_MEANING": "To dream of your emotions means that you are trying to hold back your emotions in your waking life but you cannot control them in your dreams. So your dreams act as a release for these feelings that you are suppressing. If you are emotionless in your dream it indicates that you are the same way in reality, you are neglecting your feelings and need to let them loose.",
        "DREAM_TERM": "Emotional",
        "createdAt": "2015-09-25T15:37:16.305Z",
        "objectId": "MwLsceEasB",
        "updatedAt": "2015-09-25T15:46:35.765Z"
    },
	{
        "DREAM_MEANING": "A gem is hard to find and valuable. When you dream of a gem this means that you have high expectations or you’ve found something of great importance to you. If you give someone a gem it represents your feeling of giving someone an important part of you.",
        "DREAM_TERM": "Gems",
        "createdAt": "2015-09-25T15:42:13.435Z",
        "objectId": "MxqmD0dk32",
        "updatedAt": "2015-09-25T15:59:10.748Z"
    },
	{
        "DREAM_MEANING": "Could you or somebody you know might be a little worm?  This is not a really positive symbol that shows a lack of trying in life.",
        "DREAM_TERM": "worm",
        "createdAt": "2015-09-20T04:06:32.367Z",
        "objectId": "N92pS3wB0b",
        "updatedAt": "2015-09-20T04:06:35.175Z"
    },
	{
        "DREAM_MEANING": "Being afraid in your dream is usually a nightmare of some sort.  You are afraid of something in your walking life and the person in your dream may help you understand.  ",
        "DREAM_TERM": "afraid",
        "createdAt": "2015-09-19T06:47:06.984Z",
        "objectId": "NSCSwbDta6",
        "updatedAt": "2015-09-19T06:47:16.295Z"
    },
	{
        "DREAM_MEANING": "When you dream that you are outside it denotes your ability to appreciate all that life has to offer. You are accepting and free to go out as you please. On the other hand the dream could mean that you are doing precisely the opposite and you need to go out and enjoy yourself more.",
        "DREAM_TERM": "outside",
        "createdAt": "2015-09-20T00:14:14.968Z",
        "objectId": "NoTWljpL3W",
        "updatedAt": "2015-09-20T00:14:17.012Z"
    },
	{
        "DREAM_MEANING": "Do you have childlike behaviors? Do you need to take a break from being an adult and start to go back to a more playful enjoyable life?",
        "DREAM_TERM": "children",
        "createdAt": "2015-09-19T07:18:44.460Z",
        "objectId": "NvcXCCGwpx",
        "updatedAt": "2015-09-19T07:19:08.007Z"
    },
	{
        "DREAM_MEANING": "Whenever we break some object in our dream symbolizes change or broken dreams.  To see broken glass like plates or glasses represents our values and pride.",
        "DREAM_TERM": "breaking",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:09:42.297Z",
        "objectId": "O00klviSHK",
        "updatedAt": "2015-09-19T07:09:57.418Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a notebook signifies that you need to take note of things and keep track of everything. Try to relate what you have in the notebook to your waking life.",
        "DREAM_TERM": "notebook",
        "createdAt": "2015-09-20T00:08:23.345Z",
        "objectId": "O5UxBzO5o1",
        "updatedAt": "2015-09-20T00:08:25.473Z"
    },
	{
        "DREAM_MEANING": "You have finally seen the light! Dreaming of seeing something illuminated indicates that you have finally understood and discovered something that you had problems with before.",
        "DREAM_TERM": "illumination",
        "createdAt": "2015-09-19T22:34:15.084Z",
        "objectId": "O78XxOPjQ3",
        "updatedAt": "2015-09-19T22:34:18.125Z"
    },
	{
        "DREAM_MEANING": "Your unconscious associates words with symbols. Your unconscious is telling you to just do it do what you need to do. The tick represents a go ahead and get your game on.",
        "DREAM_TERM": "nike",
        "createdAt": "2015-09-20T00:07:42.929Z",
        "objectId": "OEQbSF7p36",
        "updatedAt": "2015-09-20T00:07:44.963Z"
    },
	{
        "DREAM_MEANING": " Dreaming of an x indicates something that you are prohibited from. If you see a map with an x it represents treasures and ambitions that you would soon achieve",
        "DREAM_TERM": "x",
        "createdAt": "2015-09-20T04:07:03.947Z",
        "objectId": "OS3WSDjuLa",
        "updatedAt": "2015-09-20T04:07:06.014Z"
    },
	{
        "DREAM_MEANING": "Dreaming of the planet Venus represents feminine energies and attributes.",
        "DREAM_TERM": "venus",
        "createdAt": "2015-09-20T03:53:07.489Z",
        "objectId": "OiXm6aFLZ9",
        "updatedAt": "2015-09-20T03:53:09.742Z"
    },
	{
        "DREAM_MEANING": "When you dream of your parents it indicates strength, love, protection and guidance. Are you worried about your parents or becoming a parent?  You might hope to be like your parents when you become one or you are worried about losing your parents.If your parents die in your dream it suggests a change in your connection with your parents.",
        "DREAM_TERM": "parents",
        "createdAt": "2015-09-20T00:17:55.310Z",
        "objectId": "P6aSrmLDR8",
        "updatedAt": "2015-09-20T00:17:57.221Z"
    },
	{
        "DREAM_MEANING": "Having good luck in your dream implies that you will have a turn of luck in your life.\nIf you dream of having bad luck it suggests that you pity your position in life. You seem to be passing the blame for your unfortunate mishaps but you should really pay attention to how things really happened",
        "DREAM_TERM": "luck",
        "createdAt": "2015-09-19T23:00:22.478Z",
        "objectId": "PAgMRqgoD9",
        "updatedAt": "2015-09-19T23:00:24.848Z"
    },
	{
        "DREAM_MEANING": "Having visions in your dream is a very strong and unusual feeling. These dreams imply that your mind is open and you are exploring it without limitations.If you are unable to see clearly in your dream it suggests that you are not thinking straight and thus likely to make silly decisions.",
        "DREAM_TERM": "vision",
        "createdAt": "2015-09-20T03:55:42.957Z",
        "objectId": "PI39Ddio69",
        "updatedAt": "2015-09-20T03:55:45.573Z"
    },
	{
        "DREAM_MEANING": "A puzzle, jigsaw or crossword, in your dream signifies a psychological problem. You may not be putting all the pieces of the puzzle together. Also, if there are pieces missing then you are missing clues and facts that could help you piece together a problem in your life.",
        "DREAM_TERM": "puzzle",
        "createdAt": "2015-09-20T00:21:13.613Z",
        "objectId": "PNrXXRY01P",
        "updatedAt": "2015-09-20T00:21:19.106Z"
    },
	{
        "DREAM_MEANING": "This is a very positive dream symbol that might be related to something mystical about you.  If you where acting out as the pharaoh in your dream suggests that you like power and authority",
        "DREAM_TERM": "pharoah",
        "createdAt": "2015-09-20T00:19:23.989Z",
        "objectId": "PNvhgNfrBl",
        "updatedAt": "2015-09-20T00:19:26.172Z"
    },
	{
        "AUTHOR": "Michael",
        "DREAM_MEANING": "When we dream of a mass abundance of items in our dreams suggests that you need to stop being so selfish. ",
        "DREAM_TERM": "abundance",
        "createdAt": "2015-09-19T06:35:37.958Z",
        "objectId": "POo9kz9v1T",
        "updatedAt": "2015-09-19T06:37:53.528Z"
    },
	{
        "DREAM_MEANING": "A jet symbolizes you are going to fast in your life or your life is flying ahead of you",
        "DREAM_TERM": "jet",
        "createdAt": "2015-09-19T22:42:26.553Z",
        "objectId": "PZM4Ywgb1u",
        "updatedAt": "2015-09-19T22:42:31.918Z"
    },
	{
        "DREAM_MEANING": "A car in your dream is a very important symbol that you want to pay close attention too. When we dream of being in a car you must remember every detail about it. Where you driving? Was somebody driving you? What were the conditions of the road and the weather? (More details in entry)",
        "DREAM_TERM": "car",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:14:24.934Z",
        "objectId": "PZxuN8cHqg",
        "updatedAt": "2015-09-19T07:15:43.442Z"
    },
	{
        "DREAM_MEANING": "Dreaming of pearls represents beauty and cleanliness. On the other hand if the pearl is shaped a certain way it suggests unhappiness. The color of the pearl plays a big part in the meaning of the dream as well. If it is a black pearl, your dream signifies misfortune.",
        "DREAM_TERM": "pearl",
        "createdAt": "2015-09-20T00:18:25.665Z",
        "objectId": "PaWEcQnYu7",
        "updatedAt": "2015-09-20T00:18:28.255Z"
    },
	{
        "DREAM_MEANING": "If you dream about macaroni means that you want inner peace with yourself and others around you. You want to go back in the past where you life was easy going.",
        "DREAM_TERM": "macaroni",
        "createdAt": "2015-09-19T23:53:11.102Z",
        "objectId": "Pl6ArN5j6q",
        "updatedAt": "2015-09-19T23:53:20.241Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a gate that is opened symbolizes chances to do things in your life. The gate means that you are venturing out into new fields in your life.\nIf the gate is closed that means you do not know how to cross bridges and move on to new things in life. Whatever problem you are facing is not going to go away on its own; you need to do something about it and the gate would open for you.",
        "DREAM_TERM": "Gate",
        "createdAt": "2015-09-25T15:42:10.283Z",
        "objectId": "PrCHnCCbGW",
        "updatedAt": "2015-09-25T15:58:39.445Z"
    },
	{
        "DREAM_MEANING": "What colour is the paint? Dreaming of paint represents your feelings. Try to understand the colour and how it relates to your emotions in your life.",
        "DREAM_TERM": "paint",
        "createdAt": "2015-09-20T00:15:32.069Z",
        "objectId": "QBoRo8XIEq",
        "updatedAt": "2015-09-20T00:15:44.722Z"
    },
	{
        "DREAM_MEANING": "A knife is symbolic of frustration, rage and negative feelings. The dream means that you need to separate yourself and cut away from things in your life that is causing you distress. It could be a relationship, negative situation or a bad habit that you need to cut out of your life.",
        "DREAM_TERM": "knife",
        "createdAt": "2015-09-19T22:52:45.384Z",
        "objectId": "QPQRrwC4iR",
        "updatedAt": "2015-09-19T22:52:49.159Z"
    },
	{
        "DREAM_MEANING": "Are you planting in a garden, is it barren or fruitful? If you dream of a fruitful garden then whatever idea you have executed in your walking life is working well for you and you are going to go far with it. If you are planting something in a garden then you are either burying your past or ready to see if your plans would work out. If your garden is full of flowers this is symbolic of peace and love. If your garden is barren and full of weeds this represents your ignorance to your life and what has been happening around you. You are bringing yourself down.",
        "DREAM_TERM": "Garden",
        "createdAt": "2015-09-25T15:42:08.973Z",
        "objectId": "QYKVpFHGGW",
        "updatedAt": "2015-09-25T15:58:24.080Z"
    },
	{
        "DREAM_MEANING": "How are you climbing? This dream relates to your current life’s movements.  Weather you are struggling or making it up easy suggest how you are going by on life.",
        "DREAM_TERM": "climb",
        "createdAt": "2015-09-19T07:21:17.803Z",
        "objectId": "QYspUYFkDV",
        "updatedAt": "2015-09-19T07:21:41.978Z"
    },
	{
        "DREAM_MEANING": " Dreaming of vines denotes positive and determined thinking. You know what you want and you are going to climb to the top to reach it. On the other hand, vines could mean attachment and being tied down. You feel that some relationship or situation is causing you to feel a bit stifled and you want to let loose.",
        "DREAM_TERM": "vines",
        "createdAt": "2015-09-20T03:54:46.891Z",
        "objectId": "QlsONP5qPU",
        "updatedAt": "2015-09-20T03:54:48.754Z"
    },
	{
        "DREAM_MEANING": "Contracting a virus in your dream symbolizes your feelings and you are on the brink of breaking down. Perhaps getting sick is your way of escaping the situation.",
        "DREAM_TERM": "virus",
        "createdAt": "2015-09-20T03:55:25.523Z",
        "objectId": "QmDeSP13Ri",
        "updatedAt": "2015-09-20T03:55:28.393Z"
    },
	{
        "DREAM_MEANING": "To dream of eating fast food represents your lack of care with your body. It could be that you are not giving yourself the chance to indulge a bit because of your fear of becoming fat or that you have been over indulging and your body is suffering from it.",
        "DREAM_TERM": "Fast Food",
        "createdAt": "2015-09-25T15:41:25.935Z",
        "objectId": "QzowcIhOI9",
        "updatedAt": "2015-09-25T15:52:01.108Z"
    },
	{
        "DREAM_MEANING": "Being on a boat in water represents a part of your emotions that you are over looking.  Depending if the water is rough, clear or dirty it will help you understand how you feel about your emotions.  It’s quite possible that you are trying to get in deeper with your unconscious mind to find hidden aspects of yourself.",
        "DREAM_TERM": "boat",
        "createdAt": "2015-09-19T07:09:13.061Z",
        "objectId": "RMY2C5GNDd",
        "updatedAt": "2015-09-19T07:09:14.640Z"
    },
	{
        "DREAM_MEANING": "Dreaming of this reptile represents cold hearted attitude. You feel bad about giving someone the cold shoulder or someone has been hurting you lately.",
        "DREAM_TERM": "iguana",
        "createdAt": "2015-09-19T22:33:43.038Z",
        "objectId": "ROBpqri5KH",
        "updatedAt": "2015-09-19T22:33:47.868Z"
    },
	{
        "DREAM_MEANING": "A dream about wading in water means that you are able to take control of your feelings. Measurements of depth and clearness of the water denote the amount of authority you have with regards to the circumstances that may elicit such a dream",
        "DREAM_TERM": "wading",
        "createdAt": "2015-09-20T03:59:03.633Z",
        "objectId": "RivQwNEOii",
        "updatedAt": "2015-09-20T03:59:06.803Z"
    },
	{
        "DREAM_MEANING": "The dream signifies your emotions of being taken aback by someone or a situation. Otherwise it indicates your need for security and shelter.",
        "DREAM_TERM": "jar",
        "createdAt": "2015-09-19T22:40:25.507Z",
        "objectId": "Rljd5zmu1L",
        "updatedAt": "2015-09-19T22:40:35.135Z"
    },
	{
        "DREAM_MEANING": "Similar to ham, you need to let loose in order for you to feel full and complete. You could also be feeling unhappy with a current situation or person in your life and need a bigger portion to feel satisfied.",
        "DREAM_TERM": "Hamburger",
        "createdAt": "2015-09-25T15:42:53.461Z",
        "objectId": "RqlFeprTNC",
        "updatedAt": "2015-09-25T16:03:18.353Z"
    },
	{
        "DREAM_MEANING": "If you dream of anything landing it represents a situation that you thought was going crazy and out of your power, you now manage.",
        "DREAM_TERM": "landing",
        "createdAt": "2015-09-19T22:56:32.748Z",
        "objectId": "SFvF5PlL9Y",
        "updatedAt": "2015-09-19T22:57:24.056Z"
    },
	{
        "DREAM_MEANING": "You might be releasing some emotions that you are incapable of releasing in your walking life.",
        "DREAM_TERM": "crying",
        "createdAt": "2015-09-19T07:20:06.801Z",
        "objectId": "SNb9CNgIjL",
        "updatedAt": "2015-09-19T07:20:09.029Z"
    },
	{
        "DREAM_MEANING": "An elevator is a very powerful symbol! Generally an elevator is symbolic of different stages in your subconscious. If you’ve seen the movie inception youd understand that specific memories are on each floor of the elevator, the lower the floor the more you regret the memory. The memories are generally of things or people you miss or of feelings which is not exposed in your waking life and buried in your subconscious.",
        "DREAM_TERM": "Elevator",
        "createdAt": "2015-09-25T15:36:53.795Z",
        "objectId": "SRAH2DyXdB",
        "updatedAt": "2015-09-25T15:45:46.082Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a zodiac sign or signs represents your connection to your conscious and the rest of the world. If you dream of one particular zodiac sign you should be attention to its symbol and meaning and how it relates to you.",
        "DREAM_TERM": "zodiac",
        "createdAt": "2015-09-20T04:13:23.486Z",
        "objectId": "Sa5ciuVT5o",
        "updatedAt": "2015-09-20T04:13:25.373Z"
    },
	{
        "DREAM_MEANING": "Is it your trash or someone elses? If you find yourself throwing away things in your dream then you are trying to get rid of things that you do not like about yourself. You are ultimately throwing out unwanted qualities that you no longer desire to be part of your personality. Perhaps you need to be more responsible and stop leaving things aside to pile up and create a clutter.\n\nIf you dream of going through someone elses garbage can and find something precious this represents your outlook on things. You should realize that you do not need to follow other people, change the way you look at your life. Things that mean nothing to other people could be valuable to you if you look closer.\n\nIf you own garbage can is empty then you should think about things you need out of your life. Your unconscious is telling you it is time to let go of the past or even of some idea that is not working well for you. Get rid of the garbage in your life.",
        "DREAM_TERM": "Garbage",
        "createdAt": "2015-09-25T15:42:08.263Z",
        "objectId": "SbC3bH4ODk",
        "updatedAt": "2015-09-25T15:58:17.098Z"
    },
	{
        "DREAM_MEANING": "When you dream that you are at a zoo it represents that you find you are being confined or held back from doing what you want. You feel some part of you is being held back and captivated.  On the other hand, the zoo could symbolize confusion in your life.",
        "DREAM_TERM": "zoo",
        "createdAt": "2015-09-20T04:13:48.390Z",
        "objectId": "T2MvyEdy4d",
        "updatedAt": "2015-09-20T04:13:50.405Z"
    },
	{
        "DREAM_MEANING": "Seeing a picture all depends on the dreamer.  This might have something to do with how you picture your life to be?  Think about who was in the picture the location and the time.  Picture dreams can also imply that you could be holding on to the past.\nIf you are taking a picture you might be trying to capture an important experience in your life that you dont want to forget.  This can be some type of memory that you hold close to your heart.",
        "DREAM_TERM": "picture",
        "createdAt": "2015-09-20T00:20:10.720Z",
        "objectId": "THhBR2aNwc",
        "updatedAt": "2015-09-20T00:20:12.287Z"
    },
	{
        "DREAM_MEANING": "A dream of being in a joyous state signifies blissful and peaceful relations with people you care about in your waking life.",
        "DREAM_TERM": "joy",
        "createdAt": "2015-09-19T22:45:48.926Z",
        "objectId": "TQ02MKdogv",
        "updatedAt": "2015-09-19T22:45:52.744Z"
    },
	{
        "DREAM_MEANING": "Seeing light in your dream could have a number of different connotations. Light could symbolize enlightenment or clarification. You are more aware about things now that the light has broken the darkness. If you find the light is extremely bright it suggests that you are ready to move on. It could mean in terms of moving on to the next level after death or just ready to experience more knowledge about life.",
        "DREAM_TERM": "light",
        "createdAt": "2015-09-19T22:58:13.692Z",
        "objectId": "TXXGU1rUzm",
        "updatedAt": "2015-09-19T22:58:15.757Z"
    },
	{
        "DREAM_MEANING": "If you dream of Jupiter it either symbolizes your creative and feminine energy. Also it suggests you want to venture off and broaden your outlook on life.",
        "DREAM_TERM": "jupiter",
        "createdAt": "2015-09-19T22:47:36.032Z",
        "objectId": "TYAOlCKYPL",
        "updatedAt": "2015-09-19T22:48:25.119Z"
    },
	{
        "DREAM_MEANING": " When you dream of jewelry it means you know you are valuable and proud of yourself. You know your self-worth and what good traits you hold. If you dream of a piece of jewelry you should relate it to your life and what it means to you. If you dream of receiving jewelry, you should pay attention to the piece of jewelry. ",
        "DREAM_TERM": "jewelry",
        "createdAt": "2015-09-19T22:43:02.661Z",
        "objectId": "TYnGQKuw8B",
        "updatedAt": "2015-09-19T22:43:07.813Z"
    },
	{
        "DREAM_MEANING": "Could you see what picture is in the tiny negative? Dreaming of a picture negative symbolizes a negative situation which is developing in your life. It could be a person, relationship or job that is causing negativity in your life.",
        "DREAM_TERM": "negatives",
        "createdAt": "2015-09-20T00:04:44.436Z",
        "objectId": "TfUz2rWw94",
        "updatedAt": "2015-09-20T00:04:46.630Z"
    },
	{
        "DREAM_MEANING": "Dreaming of an elbow is a great dream symbol that shows you have the ability to be flexible during tough times. If you notice that your elbow is damaged, it means that people are taking advantage of you and you need to stand your ground. It could also mean that you cannot adapt to your current situation in life, you need to find a way to work around things and stretch to meet your needs.",
        "DREAM_TERM": "Elbows",
        "createdAt": "2015-09-25T15:35:45.825Z",
        "objectId": "TqsgMQLBwg",
        "updatedAt": "2015-09-25T15:44:29.506Z"
    },
	{
        "DREAM_MEANING": "Do you need to be grounded in life right now?  This symbol might be translated to a powerful force and stability in your life.  Spiritually it might suggest a higher form of consciousness and energy level.",
        "DREAM_TERM": "mountain",
        "createdAt": "2015-09-20T00:00:14.186Z",
        "objectId": "Tw2OvcGv1Q",
        "updatedAt": "2015-09-20T00:00:16.208Z"
    },
	{
        "DREAM_MEANING": "A dream of Jesus represents your spirituality or lack of. The dream indicates that you know Jesus is present in your life but if you are not connected with your spirituality your unconscious is telling you to be more in tuned.",
        "DREAM_TERM": "jesus",
        "createdAt": "2015-09-19T22:42:04.994Z",
        "objectId": "U4IVikEEeB",
        "updatedAt": "2015-09-19T22:42:15.382Z"
    },
	{
        "AUTHOR": "Michael",
        "DREAM_MEANING": "People who dream about being abducted mean that somebody close to you in your life is controlling your every move.",
        "DREAM_TERM": "abduction",
        "createdAt": "2015-09-19T06:30:19.562Z",
        "objectId": "U7Cr4qU7ug",
        "updatedAt": "2015-09-19T06:38:03.116Z"
    },
	{
        "DREAM_MEANING": "A dream about your father suggests authority and security problems or acceptance. It could be anyone in y our life who is trying to be in charge or tell you what to do. You may also be similar to your father so take a look at his character in the dream and see if you have a similar quality that you may not like and trying to deny it in your waking life.\n\nWhen you argue with your father in your dream it means that you are trying to rebel or you are doing so. Your dream may be your only way of letting your anger out about not being able to be in charge of your own life. If you hit your father in the disagreement it actually symbolizes a desire you having a better relationship with him. You feel rejected in some aspect of his life and you are trying to get him to listen and be closer with you.\n\nIf you have a dream with intimacy with your father it indicates that you try to handle your problems with authority or to get above or ahead people who are in charge of you, whether it be a principle or boss, you use sexual seduction methods.\n\nAlternatively a dream of having a good conversation and open relationship with your father means you have accepted authority figures in your life.",
        "DREAM_TERM": "Father",
        "createdAt": "2015-09-25T15:41:29.726Z",
        "objectId": "UEiM3C5ecn",
        "updatedAt": "2015-09-25T15:52:28.272Z"
    },
	{
        "DREAM_MEANING": "Are you following and taking orders that you wont normally do in your waking life? This signifies your acceptance that there are others who have greater power and authority over you. Otherwise, it means you are too weak and allowing others to take advantage of you. Learn to stand your ground!",
        "DREAM_TERM": "obedience",
        "createdAt": "2015-09-20T00:09:50.674Z",
        "objectId": "UKUuPNGVp9",
        "updatedAt": "2015-09-20T00:09:53.887Z"
    },
	{
        "DREAM_MEANING": " A dream involving a jack in the box represents a good shock, a surprise that would be pleasing to you.",
        "DREAM_TERM": "jack in the box",
        "createdAt": "2015-09-19T22:38:28.171Z",
        "objectId": "UUHOxG7EhD",
        "updatedAt": "2015-09-19T22:38:32.707Z"
    },
	{
        "DREAM_MEANING": "Any dream to do with an earthquake suggests that there will be a major change for good or bad in your walking life. This is a dream that you should pay close attention to and if you handle the earthquake in a good way it means you are going to overcome the obstacle.  Being injured in the earthquake symbolizes that you would be shaken up in your life. The location and people in your dream would represent who would be affected by the changes in your life.",
        "DREAM_TERM": "Earthquake",
        "createdAt": "2015-09-25T15:27:15.462Z",
        "objectId": "UpRefpylIQ",
        "updatedAt": "2015-09-25T15:27:45.398Z"
    },
	{
        "DREAM_MEANING": "When you dream of being at ease and in a state of zen it signifies that you need are either able to find tranquility or you find it hard to relax.",
        "DREAM_TERM": "zen",
        "createdAt": "2015-09-20T04:15:20.260Z",
        "objectId": "Uyo1BMlN76",
        "updatedAt": "2015-09-20T04:15:22.265Z"
    },
	{
        "DREAM_MEANING": "Do you feel nerdy of late? The dream implies that you are feeling neglected and shunned by others.",
        "DREAM_TERM": "nerd",
        "createdAt": "2015-09-20T00:05:31.677Z",
        "objectId": "V30vCc85Si",
        "updatedAt": "2015-09-20T00:05:34.663Z"
    },
	{
        "DREAM_MEANING": "When you dream of a xylophone it signifies your drive to help the environment.",
        "DREAM_TERM": "xylophone",
        "createdAt": "2015-09-20T04:07:32.097Z",
        "objectId": "V454snb2y4",
        "updatedAt": "2015-09-20T04:07:34.833Z"
    },
	{
        "DREAM_MEANING": "To dream that you are going mad or going crazy suggest that you have lost control with yourself. You need to come back down to reality and remember that things will eventually smooth out. In your walking life if you are stressed you will have dreams about going crazy. You need to take a break and time out too cool down.\nIf you see mad people or a crazy asylum represents darkness and despair. You need to think more positive and rid the negative thinking.",
        "DREAM_TERM": "madness",
        "createdAt": "2015-09-19T23:54:15.142Z",
        "objectId": "VIdjuA2S3F",
        "updatedAt": "2015-09-19T23:54:24.593Z"
    },
	{
        "DREAM_MEANING": "Many people use the New Year as a time to make resolutions and changes. Thus dreaming of it suggests that you want to start anew and try to better certain areas of your life. On the other hand, you might just be looking forward to the New Year and your dream expresses that excitement.",
        "DREAM_TERM": "new year",
        "createdAt": "2015-09-20T00:06:07.919Z",
        "objectId": "Vgy0zOK0jv",
        "updatedAt": "2015-09-20T00:06:10.190Z"
    },
	{
        "DREAM_MEANING": "These dreams are usually symbolic that hold a very powerful message of protection, love, guidance and help.  Could this be one of your guides that looks out for you?",
        "DREAM_TERM": "angels",
        "createdAt": "2015-09-19T06:55:17.665Z",
        "objectId": "VpYkB6xQVT",
        "updatedAt": "2015-09-19T06:55:22.665Z"
    },
	{
        "DREAM_MEANING": "If the landscape keeps changing it signifies alterations and changes that you are going through in order to achieve goals you have set. It is a symbol for the phases in your life. Otherwise, if you have been looking at a situation from one point of view and not examining different approaches, your dream is telling you in order to overcome it or progress you must look from all angles.",
        "DREAM_TERM": "landscape",
        "createdAt": "2015-09-19T22:56:54.486Z",
        "objectId": "VqVGMV2eZU",
        "updatedAt": "2015-09-19T22:56:56.516Z"
    },
	{
        "DREAM_MEANING": "To dream of ecstasy is very good for your mind and soul, it leave you feeling happy all day. In the past, dream philosophers have said that this feeling is a taste of the afterlife.",
        "DREAM_TERM": "Ectasy",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-25T15:35:33.756Z",
        "objectId": "VtYRsM6jZX",
        "updatedAt": "2015-09-25T15:43:57.528Z"
    },
	{
        "DREAM_MEANING": "Being on vacation in your dream suggests that you need to get away and recuperate. You feel overwhelmed with your daily responsibilities and need time to get away from it all. The dream could also mean that you know you need a break after you complete your hard work.",
        "DREAM_TERM": "vacation",
        "createdAt": "2015-09-20T03:49:07.773Z",
        "objectId": "W4NSCDIhDT",
        "updatedAt": "2015-09-20T03:49:09.946Z"
    },
	{
        "DREAM_MEANING": " Are you trying to cover up what you are thinking?  Why are you wearing the wig and how do you feel when wearing it?",
        "DREAM_TERM": "wig",
        "createdAt": "2015-09-20T04:05:40.705Z",
        "objectId": "W636G5dsEr",
        "updatedAt": "2015-09-20T04:05:43.065Z"
    },
	{
        "DREAM_MEANING": "Dreaming of someone knocking is a metaphor of chances and opportunities that are knocking at your door. On the other hand it could mean that you need someone to offer help to you. A knocker is also a bad prophecy which symbolizes death and a fearful future.",
        "DREAM_TERM": "knock",
        "createdAt": "2015-09-19T22:53:35.081Z",
        "objectId": "WTqhkWfj6w",
        "updatedAt": "2015-09-19T22:53:37.424Z"
    },
	{
        "DREAM_MEANING": "Airplane’s in dreams are a very important dream symbol that should not be over looked. Search in our dream dictionary for the full text.",
        "DREAM_TERM": "airplane",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T06:48:33.486Z",
        "objectId": "WdTdUQhhIl",
        "updatedAt": "2015-09-19T07:05:05.455Z"
    },
	{
        "DREAM_MEANING": "Dreaming of karaoke could mean that you are either too confident in yourself or you doubt your talents.",
        "DREAM_TERM": "karaoke",
        "createdAt": "2015-09-19T22:48:42.054Z",
        "objectId": "WueptQo6OW",
        "updatedAt": "2015-09-19T22:48:58.626Z"
    },
	{
        "DREAM_MEANING": "A dream where you see a vault represents thoughts that you keep out of the conscious mind. You have some hidden talents and skills that you have not yet discovered or allowed into your social life. The vault also represents ideas that you hide in your unconscious mind.",
        "DREAM_TERM": "vault",
        "createdAt": "2015-09-20T03:52:01.241Z",
        "objectId": "WuvSUqxCcQ",
        "updatedAt": "2015-09-20T03:52:04.049Z"
    },
	{
        "DREAM_MEANING": "Being vaccinated in your dream implies that a situation is going to cause you some pain, at first, then you will benefit from it. On the other hand it indicates that you are worried about contracting a disease in your waking life. If you dream of someone else receiving a vaccination, it suggests that you are being pressured and persuaded by people in your life.",
        "DREAM_TERM": "vaccination",
        "createdAt": "2015-09-20T03:49:22.535Z",
        "objectId": "Wx3TkxTycH",
        "updatedAt": "2015-09-20T03:49:30.121Z"
    },
	{
        "DREAM_MEANING": "To dream the end to something indicates that you need to hurry up and act because time is of importance and youre anxious about that certain situation. If you dream the end of the world where the world blows up or the sky is coming closer and closer to the ground it is only your fear of the change that is about to come. It could also mean that you are craving a new thrill in your life, you want a new journey.",
        "DREAM_TERM": "End",
        "createdAt": "2015-09-25T15:37:49.914Z",
        "objectId": "WzmuJ8ZUJF",
        "updatedAt": "2015-09-25T15:46:52.374Z"
    },
	{
        "DREAM_MEANING": "An elephant is symbolic of holding on to memories or something that is uncontrollable. To dream that you are looking and admiring elephants means you are looking back at your life and how your past has affected you and made you the person you are today. To see a white elephant in your dream represents royalty or your personality of being powerful and honored.",
        "DREAM_TERM": "Elephant",
        "createdAt": "2015-09-25T15:36:47.096Z",
        "objectId": "XZnVaz5g3M",
        "updatedAt": "2015-09-25T15:45:16.506Z"
    },
	{
        "DREAM_MEANING": "When you dream of revisiting your kindergarten days, you are reminiscing your past and, maybe, wishing you could go back to those days. Otherwise, it indicates knowledge and changes from immature into maturity.",
        "DREAM_TERM": "kindergarten",
        "createdAt": "2015-09-19T22:51:26.906Z",
        "objectId": "Xg6lzUZZyp",
        "updatedAt": "2015-09-19T22:51:32.154Z"
    },
	{
        "DREAM_MEANING": "When you dream of taking a nap it implies that you are too stressed and you need to slow down and unwind.",
        "DREAM_TERM": "nap",
        "createdAt": "2015-09-20T00:02:07.146Z",
        "objectId": "Xiu3SN5vlj",
        "updatedAt": "2015-09-20T00:02:09.344Z"
    },
	{
        "DREAM_MEANING": " Depending of the context of you’re dream the meaning of a cliff can drastically change.  If you are looking over a cliff and it is positive then it suggests personal achievements that you have over come.  If you are hanging off a cliff that suggests that you might not be totally secure in your life at the moment and need a firmer grip.",
        "DREAM_TERM": "cliff",
        "createdAt": "2015-09-19T07:21:05.944Z",
        "objectId": "XnsAx0WMCe",
        "updatedAt": "2015-09-19T07:21:31.759Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a lock represents that you cannot get what you desire. If you are locked out of something, first relate what you are looked out of to your life. Maybe you are concealing parts of yourself. You feel confused and locked out of society.",
        "DREAM_TERM": "lock",
        "createdAt": "2015-09-19T22:59:12.948Z",
        "objectId": "Xpp9KNOHSt",
        "updatedAt": "2015-09-19T22:59:15.291Z"
    },
	{
        "DREAM_MEANING": "A dream of being unemployed indicates you have low self esteem. You do not believe in your abilities. This lack of confidence in yourself is holding you back from moving forward.",
        "DREAM_TERM": "unemployed",
        "createdAt": "2015-09-20T03:45:39.261Z",
        "objectId": "YDAxgnTigA",
        "updatedAt": "2015-09-20T03:46:21.760Z"
    },
	{
        "DREAM_MEANING": "A farmer works hard day in and out to yield good crops. When you dream of being a farmer it means that you should work a bit harder and you would be more fruitful in life.",
        "DREAM_TERM": "Farmer",
        "createdAt": "2015-09-25T15:41:23.770Z",
        "objectId": "YGIpzZpnZE",
        "updatedAt": "2015-09-25T15:51:45.657Z"
    },
	{
        "DREAM_MEANING": "Waiting patiently in a dream implies that you know that things in life take time. Some things are worth the wait and hassling does not help some situations. Alternately, being impatient represents your dependability and controlling demeanor to people; you expect too much out of a situation. It could also mean you are worried about something but it is better if you slow down and stop being so anxious.",
        "DREAM_TERM": "waiting",
        "createdAt": "2015-09-20T04:01:26.885Z",
        "objectId": "YJFQ8OFTys",
        "updatedAt": "2015-09-20T04:01:30.125Z"
    },
	{
        "DREAM_MEANING": "Dreaming of using a computer keyboard suggests that you have a message that you need to relay to someone immediately but you cannot do it in person.",
        "DREAM_TERM": "keyboard",
        "createdAt": "2015-09-19T22:50:37.706Z",
        "objectId": "YN2dvNXhvi",
        "updatedAt": "2015-09-19T22:50:41.442Z"
    },
	{
        "DREAM_MEANING": "Icicles represent turmoil and hardship in your life. If you see the icicles melting in your dream it suggests that they would go away soon. On the other hand if the icicles are forming it is a warning that there will be tough times ahead.",
        "DREAM_TERM": "icicles",
        "createdAt": "2015-09-19T22:30:15.033Z",
        "objectId": "YYHv5pzVL3",
        "updatedAt": "2015-09-19T22:30:43.842Z"
    },
	{
        "DREAM_MEANING": "Whether you are being decapitated in your dream or someone else is, decapitation in a dream has to do with not having sensible thoughts. If you are being decapitated, start using your brain to think and see the light in situations, don’t be careless and start thinking before you act.",
        "DREAM_TERM": "decapitation",
        "createdAt": "2015-09-19T07:27:08.253Z",
        "objectId": "YZcgikR2qY",
        "updatedAt": "2015-09-19T07:27:13.461Z"
    },
	{
        "DREAM_MEANING": "Wearing or seeing a jacket in a dream suggests you are covering up your emotions and protecting yourself from being hurt. How you feel is dependent on the jackets condition and look. For example if the jacket is dingy and dark it indicates feelings of depression and being used.",
        "DREAM_TERM": "jacket",
        "createdAt": "2015-09-19T22:39:07.230Z",
        "objectId": "YosgsLRY9N",
        "updatedAt": "2015-09-19T22:39:15.090Z"
    },
	{
        "DREAM_MEANING": "Dreaming of ice symbolizes frozen emotions, your emotions have not changed towards something or someone.",
        "DREAM_TERM": "ice",
        "createdAt": "2015-09-19T22:26:10.665Z",
        "objectId": "Ypx5jO7VVx",
        "updatedAt": "2015-09-19T22:26:34.958Z"
    },
	{
        "DREAM_MEANING": "A dream of icing represents your attitude and how to portray yourself, you seem to be doing well on the outside but when people get to know you, they know something is wrong. On the other hand, it could simply mean that you have almost reached where you want to be in life and you are just adding the finishing touches.",
        "DREAM_TERM": "icing",
        "createdAt": "2015-09-19T22:30:51.309Z",
        "objectId": "YqNrxTBUzC",
        "updatedAt": "2015-09-19T22:31:01.383Z"
    },
	{
        "DREAM_MEANING": "When you faint in a dream it means that you are not prepared for something. If you faint after seeing someone it means that you are not quite prepared to confront that person in reality. Fainting on your own symbolizes your unpreparedness for a situation.",
        "DREAM_TERM": "Fainting",
        "createdAt": "2015-09-25T15:40:36.644Z",
        "objectId": "YyzjmC7WOA",
        "updatedAt": "2015-09-25T15:49:03.178Z"
    },
	{
        "DREAM_MEANING": "Dreaming of land symbolizes that you should be secured and cool about lifes situations. The dream could also be a pun on “landing” something like a promotion or good grade.",
        "DREAM_TERM": "land",
        "createdAt": "2015-09-19T22:56:12.804Z",
        "objectId": "Z4b0i8Awge",
        "updatedAt": "2015-09-19T22:56:17.321Z"
    },
	{
        "DREAM_MEANING": "When you dream of an ocean it is symbolic of emotions. Alternatively, the dream means that you are feeling empowered and unhindered. The ocean represents opportunities with no barriers. If the ocean is calm then you are relaxed.",
        "DREAM_TERM": "ocean",
        "createdAt": "2015-09-20T00:11:33.249Z",
        "objectId": "ZS2nozdVpf",
        "updatedAt": "2015-09-20T00:11:36.153Z"
    },
	{
        "DREAM_MEANING": "Depending on the context of the “death” in the dream it can mean more than one thing but do not be alarmed death is usually a positive symbol. (More detail in entry)",
        "DREAM_TERM": "death",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:26:17.649Z",
        "objectId": "ZSBK8B5TII",
        "updatedAt": "2015-09-19T07:26:45.760Z"
    },
	{
        "DREAM_MEANING": " If you dream that you are jogging it indicates you are making progress but at a continuing sturdy pace. If you try hard you’d reach where you want faster",
        "DREAM_TERM": "jogging",
        "createdAt": "2015-09-19T22:44:59.647Z",
        "objectId": "ZYg65wTtpb",
        "updatedAt": "2015-09-19T22:45:09.533Z"
    },
	{
        "DREAM_MEANING": " Where where you when the anxiety hit you in the dream? The location and people around you might be a hint of who might be causing it. If you are alone maybe you need time to relax and take a breath.",
        "DREAM_TERM": "anxiety",
        "createdAt": "2015-09-19T06:54:56.101Z",
        "objectId": "ZdcfiGDfB1",
        "updatedAt": "2015-09-19T06:54:59.098Z"
    },
	{
        "DREAM_MEANING": "Something seems to be incomplete and missing its other half or is it half full? What is your reaction to the dream? If you feel like you have gotten half way there then this is a good sign, keep working to complete your goals. If you feel disappointed then something is incomplete in your waking life and someone or something is not allowing you to make it complete.",
        "DREAM_TERM": "Half",
        "createdAt": "2015-09-25T15:42:49.881Z",
        "objectId": "Zgapw2ofXL",
        "updatedAt": "2015-09-25T16:03:46.522Z"
    },
	{
        "DREAM_MEANING": "If you are sending a message in your dream you should find out who you where sending it to. Whoever it was you must communicate with them A.S.AP. Dream of either verbal or tangible message is your unconscious trying to give you a hint that is very important.",
        "DREAM_TERM": "message",
        "createdAt": "2015-09-19T23:57:26.046Z",
        "objectId": "aBk8yHwVXj",
        "updatedAt": "2015-09-19T23:57:28.301Z"
    },
	{
        "DREAM_MEANING": "You do not need to be a man to dream of an erection nor does it have to relate to your sexuality. When you dream you have an erection it symbolizes your control and authority. To dream of someone elses erection which pleasures you appeals to your sexual craving. If you are sickened by the erection it means that you are angry about someone else rising up and being in control of things. If you are a man dreaming of an erection is could mean that you are worried about having erectile dysfunction.",
        "DREAM_TERM": "Erection",
        "createdAt": "2015-09-25T15:38:05.040Z",
        "objectId": "aFHK9wwvRm",
        "updatedAt": "2015-09-25T15:47:22.722Z"
    },
	{
        "DREAM_MEANING": "A vibration is almost like a wakeup call. The dream suggests that you take heed of what is going on in all aspects of your mind",
        "DREAM_TERM": "vibrate",
        "createdAt": "2015-09-20T03:53:33.206Z",
        "objectId": "aPKzOe8XIc",
        "updatedAt": "2015-09-20T03:53:36.305Z"
    },
	{
        "DREAM_MEANING": "A hearse suggests that you need to make some changes in your life in order to move forward. Let go of whatever situation is holding you back.",
        "DREAM_TERM": "Hearse",
        "createdAt": "2015-09-25T15:43:00.563Z",
        "objectId": "aiJKn31vjC",
        "updatedAt": "2015-09-25T16:02:19.104Z"
    },
	{
        "DREAM_MEANING": "Dreaming of adventure suggests that your life at this moment is dull and need a boost of excitement.",
        "DREAM_TERM": "adventure",
        "createdAt": "2015-09-19T06:45:36.862Z",
        "objectId": "akENAAmN9I",
        "updatedAt": "2015-09-19T06:46:13.963Z"
    },
	{
        "DREAM_MEANING": "Being ignored is always a very horrible feeling but if you are the one doing the ignoring then you need to slow down with that ignorant attitude. A dream of being ignorant represents ignorance towards aspects of yourself or of others. However, if you dream that you are being ignored signifies you are feeling neglected in your waking life.",
        "DREAM_TERM": "ignorance",
        "createdAt": "2015-09-19T22:33:29.069Z",
        "objectId": "asIvrvWBVH",
        "updatedAt": "2015-09-19T22:33:35.095Z"
    },
	{
        "DREAM_MEANING": "Reminiscing of the past lately? The dream indicates that you are thinking of all the people you have lost communication with. Is there any message that you saw in your dream or have you been thinking about a particular person who signed your yearbook? The message may be some advice from your unconscious. On the other hand, you may just be missing the past where you were in school and had little or no responsibility",
        "DREAM_TERM": "yearbook",
        "createdAt": "2015-09-20T04:10:15.633Z",
        "objectId": "av5KgOiW2o",
        "updatedAt": "2015-09-20T04:10:18.134Z"
    },
	{
        "DREAM_MEANING": "Dreaming of an oasis is symbolic of either needing a vacation, thirsty for something or emotional quenching. Are you looking for an oasis or did you find one and drinking from it? If you are seeking an oasis it indicates you are on a quest to quench your worries and anxiety with inner turmoil or situations in your life. You need some sort of help in order to satisfy and get rid of the problem.",
        "DREAM_TERM": "oasis",
        "createdAt": "2015-09-20T00:09:16.345Z",
        "objectId": "b33W3pVjub",
        "updatedAt": "2015-09-20T00:09:19.191Z"
    },
	{
        "DREAM_MEANING": "To dream of an election signifies an important decision that you must make and will affect your future. Voting in an election it symbolizes your choice that you’ve already made. There’s no need to ponder on about it, you’ve already chosen what road you want to go down. If you are a candidate in the election, you want to move on to bigger and better things in life. You feel like you’ve worked hard enough and you need to be recognized for it whether it be at work or in your love life.\nWinning in an election means that you are know what you are about and soon your talents and abilities would be recognized. However, losing an election symbolizes the doubts you have in yourself, we all worry that we would make the same mistakes like in the past but try to move on and learn from it.",
        "DREAM_TERM": "Election",
        "createdAt": "2015-09-25T15:36:27.060Z",
        "objectId": "b9LSGYJF9u",
        "updatedAt": "2015-09-25T15:44:38.616Z"
    },
	{
        "DREAM_MEANING": "When you dream of water it is representative of feelings and emotions. A faucet controls when water could be used and so a faucet symbolizes your control over your feelings. Depending on the temperature of the water it would tell you what sort of feelings you are having about a situation in your life.\nIf the faucet it leaking it mentions your emotions have been going non stop and you cannot stop it, you feel exhausted from it. It could also hint towards sexual frustration.\nIf the faucet is unable to turn on or it keeps turning but no water is coming out signifies your inability to express yourself. You may try to but you hide what you really feel because you are afraid of what others would think or you could have trust issues.",
        "DREAM_TERM": "Faucet",
        "createdAt": "2015-09-25T15:41:30.660Z",
        "objectId": "bZeLb6jC24",
        "updatedAt": "2015-09-25T15:52:35.086Z"
    },
	{
        "DREAM_MEANING": " Crashing in your dream might suggest that you might come to a sudden stop in your life that may cause some disturbance.  What did you crash into and who where you with. If you where in your car when you crashed than that could imply a stop in your current drive in life.",
        "DREAM_TERM": "crash",
        "createdAt": "2015-09-19T07:20:33.553Z",
        "objectId": "bb0omz8RRB",
        "updatedAt": "2015-09-19T07:20:35.399Z"
    },
	{
        "DREAM_MEANING": "Dreaming that you are lost indicates that you have lost your way in life. You need to get back on track. You are unsure where the right way to head is. If you are asking for help it means you realise that you cannot do things on your own and you want people to advise you. On the other hand, you might be places in a new situation that you are still trying to find your way around.\nIf you dream of someone else being lost is suggests some problems you are having finding aspects of yourself. You have lost some aspect, you could notice in that person, which makes up your identity.",
        "DREAM_TERM": "lost",
        "createdAt": "2015-09-19T22:59:48.342Z",
        "objectId": "bfcVyJdhiF",
        "updatedAt": "2015-09-19T22:59:50.488Z"
    },
	{
        "DREAM_MEANING": "A dream of devotion to idols suggests false and wrong steps in your life. You are not doing anything to make progress in your life.",
        "DREAM_TERM": "idols",
        "createdAt": "2015-09-19T22:32:28.166Z",
        "objectId": "bkngFtJsmC",
        "updatedAt": "2015-09-19T22:32:31.721Z"
    },
	{
        "DREAM_MEANING": "Dreaming of dealing with an obstacle is advice for how to deal with one in your waking life. The dream is offering you solutions to a problem.",
        "DREAM_TERM": "obstacle",
        "createdAt": "2015-09-20T00:10:53.114Z",
        "objectId": "bs4HTT5UTH",
        "updatedAt": "2015-09-20T00:10:55.473Z"
    },
	{
        "DREAM_MEANING": " Pebbles in your dream suggest trivial problems and setbacks in your life. If you dream of pelting or tossing pebbles it indicated that gossip is getting to you. People are bringing you down by their little degrading comments",
        "DREAM_TERM": "pebble",
        "createdAt": "2015-09-20T00:18:38.237Z",
        "objectId": "bvM01ZXHXu",
        "updatedAt": "2015-09-20T00:18:39.966Z"
    },
	{
        "DREAM_MEANING": " This dream could suggest the feminine and maternal instinct in your life.  Freud would like to say that it would mean the butt of someone, but a more in depth look at the moon as a symbol would be Jung and he said it was a dark place for souls.  He mentioned that he saw it as far away maybe our shadow that we over look.",
        "DREAM_TERM": "moon",
        "createdAt": "2015-09-19T23:59:30.372Z",
        "objectId": "c0gUR7wfw3",
        "updatedAt": "2015-09-19T23:59:32.491Z"
    },
	{
        "DREAM_MEANING": "To see an opening in your dream, signifies a strong influence and powerful inspiration entering your life. You are feeling uplifted, confident and happy. To dream that you are opening something, suggests that you are unleashing your potential. It represents new opportunities, insight, and self-discovery.",
        "DREAM_TERM": "opening",
        "createdAt": "2015-09-20T00:12:55.783Z",
        "objectId": "c4EdLs1bb5",
        "updatedAt": "2015-09-20T00:12:58.226Z"
    },
	{
        "DREAM_MEANING": "What is the gathering about? Is it a bunch of people or are you gathering your things? When you dream about trying to gather your things and put things together it suggests that you are trying to organize the things in your life. If you dream of people gathering together then pay attention to different traits in them because your unconscious is suggesting that you are trying to use these in your personality.",
        "DREAM_TERM": "Gathering",
        "createdAt": "2015-09-25T15:42:10.991Z",
        "objectId": "cGCvEalc9X",
        "updatedAt": "2015-09-25T15:58:49.357Z"
    },
	{
        "DREAM_MEANING": "When we dream of balloons it usually has one or more meaning.  Balloons can represent your love life or hopes and dreams.  If you are holding a balloon and let it go symbolizes that you “let go” of your goals that you worked hard at.  If your balloon pops it represents your stress level.",
        "DREAM_TERM": "balloons ",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:01:41.970Z",
        "objectId": "cL0kWonh3z",
        "updatedAt": "2015-09-19T07:04:46.073Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a vacant space indicates that you need your freedom and a break from others . You need to figure out things on your own. On the other hand, it could also mean that there’s a sort of emptiness in your life that needs filling.",
        "DREAM_TERM": "vacant",
        "createdAt": "2015-09-20T03:48:50.949Z",
        "objectId": "cvAlu7L4GV",
        "updatedAt": "2015-09-20T03:48:52.939Z"
    },
	{
        "DREAM_MEANING": "Dreaming of admiring your face indicates your strength and confidence in yourself. If you are touching your face it could mean that you are looking at yourself and trying to understand how the world perceives you. You are not facing the problems you have in your life but you are hiding from the reality of things.A disfigured or blemished face whether it be your own or someone elses means a false persona. If it is your face, you are trying to hide your appearance or someone is trying to bring you down. If it is someone elses face then they are not being straight with you. Similarly, if you or someone has two faced it indicates a double sided personality. In the golden days, they used to say that a bloated face means that you are going to have an economic gain.\nIf you are cleaning your face it represents you want to come out and express your true self and wash the dirt off your reputation.",
        "DREAM_TERM": "Face",
        "createdAt": "2015-09-25T15:40:19.819Z",
        "objectId": "d9ZZeNTTAX",
        "updatedAt": "2015-09-25T15:48:14.747Z"
    },
	{
        "DREAM_MEANING": "To dream that you are diagnosed with cancer represents your internal factors in your life. (More details in entry)",
        "DREAM_TERM": "cancer",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:13:28.371Z",
        "objectId": "dJGenNRBe2",
        "updatedAt": "2015-09-19T07:14:29.391Z"
    },
	{
        "DREAM_MEANING": "Dreaming of an ointment is symbolic of curing yourself and getting to understand you better.",
        "DREAM_TERM": "ointment",
        "createdAt": "2015-09-20T00:12:23.663Z",
        "objectId": "dP5RoXrvHc",
        "updatedAt": "2015-09-20T00:12:25.588Z"
    },
	{
        "DREAM_MEANING": "When you dream of an iceberg it symbolizes a sense of not looking past what you see in front of you.",
        "DREAM_TERM": "iceberg",
        "createdAt": "2015-09-19T22:29:42.739Z",
        "objectId": "dZjt1brXdi",
        "updatedAt": "2015-09-19T22:29:59.725Z"
    },
	{
        "DREAM_MEANING": "You dream might have something to do with nature or going back to your animistic side of things.  If you dreamt of a deceased pet suggest that you miss and haven’t forgot the love that you received from it.",
        "DREAM_TERM": "pets",
        "createdAt": "2015-09-20T00:19:10.048Z",
        "objectId": "daTEYtQavd",
        "updatedAt": "2015-09-20T00:19:12.207Z"
    },
	{
        "DREAM_MEANING": "Dreaming that you feeling really bad represents that you feel somewhat guilty of a move you made.  You may feel that your not needed in life.  If you so happen to be acting bad in your dreams, symbolize your need to lighten up in life. ",
        "DREAM_TERM": "bad",
        "createdAt": "2015-09-19T06:59:23.044Z",
        "objectId": "dau6OyEEg6",
        "updatedAt": "2015-09-19T07:00:24.904Z"
    },
	{
        "DREAM_MEANING": "Hands are one of the most useful body parts. Dreams of them signify your feelings of leadership and communication with the world. To see someone elses hand is a message youre your unconscious telling you that you need to accept the help being offered to you or you need to look for help. If it is your hand outstretched then you should reach out and help someone. If you dream of your right hand it could be a pun representing someone who is close to you and does almost everything with you.\n\nIf you dream that your hands are injured or disconnected it denotes that you are not getting your ideas portrayed in the right way and people do not get you. It could also mean that you feel detached from the world and lonely.\n\nIf you have someone elses hand in yours it signifies a relationship you are worried about or feel closer than ever with someone. If you hands are together then you are at ease and peace with yourself.\n\nIf you have blood on your hands then you should wash that off because you feel responsible about something, who did you hurt? If you are washing your hand then you are getting rid of unwanted problems in your life.An itchy hand means money; dont try washing the itch away!",
        "DREAM_TERM": "Hand",
        "createdAt": "2015-09-25T15:42:57.395Z",
        "objectId": "dbuypmdfLe",
        "updatedAt": "2015-09-25T16:02:58.613Z"
    },
	{
        "DREAM_MEANING": "Changing lanes in your dream implies that you should change the way you handle different aspects of your life. You are rushing to get things done in a hasty manner which is not very safe.",
        "DREAM_TERM": "lane",
        "createdAt": "2015-09-19T22:57:14.019Z",
        "objectId": "doLB8VtLJb",
        "updatedAt": "2015-09-19T22:57:18.668Z"
    },
	{
        "DREAM_MEANING": "A dream about the galaxy indicates your ideas and views on creation. It means that you are open to other thoughts and you look at the entire and bigger picture.",
        "DREAM_TERM": "Galaxy",
        "createdAt": "2015-09-25T15:41:40.522Z",
        "objectId": "doxnbIRhUR",
        "updatedAt": "2015-09-25T15:56:49.482Z"
    },
	{
        "DREAM_MEANING": "A fairy is symbolizes a messenger in your dream. When you dream of a fairy it means you need some advice and your unconscious takes the chance to give it to you because you wont accept it from anyone else when you are conscious. When a fairy is calling you to look at something, follow it because theres a message waiting for you. Fairies are also miserable and like to play jokes on you if they manage to play games with you that you cannot seem to figure out it means that are doing this to yourself. You are not being straightforward with yourself, stop tricking your instincts. However, at the end of the day fairies are lucky characters and are sent to grant wishes. If you get a wish granted it means that you should be in high spirits because you have the ability to do well in your life.",
        "DREAM_TERM": "Fairy",
        "createdAt": "2015-09-25T15:40:40.320Z",
        "objectId": "dp40YPhG5Q",
        "updatedAt": "2015-09-25T15:49:12.117Z"
    },
	{
        "DREAM_MEANING": "Guilty as charged! Dreaming of being in jail indicates that someone has caught you doing wrong. Otherwise it means that you feel trapped in a situation in your life.",
        "DREAM_TERM": "jail",
        "createdAt": "2015-09-19T22:40:00.763Z",
        "objectId": "ebBIpEwZkc",
        "updatedAt": "2015-09-19T22:40:13.800Z"
    },
	{
        "DREAM_MEANING": " Dreaming of being victorious signifies your security and your self-confidence. You know you are able to achieve what you set your mind to but you need to find some incentive in order to do it.",
        "DREAM_TERM": "victory",
        "createdAt": "2015-09-20T03:54:08.968Z",
        "objectId": "efi8sxZ6Js",
        "updatedAt": "2015-09-20T03:54:11.411Z"
    },
	{
        "DREAM_MEANING": "Being addicted to anything in life good or bad is not that healthy.  When you dream of being addicted to a substance suggests that something in your life is like a drug to you. ",
        "DREAM_TERM": "addiction",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T06:44:25.368Z",
        "objectId": "etTGMZ9TGL",
        "updatedAt": "2015-09-19T07:05:49.481Z"
    },
	{
        "DREAM_MEANING": "If you have dream about yourself being another gender, do not be afraid your unconscious is telling you to incorporate some of these qualities into your personality. On the other hand it could mean that you are having a gender issue, you do not know what sex you feel more comfortable with. It could also mean that you are feeling sexual frustration in your waking life and you may dream of yourself being another gender but with a different personality, your dream indicates that you are attracted to someone that could have similar qualities as you.",
        "DREAM_TERM": "Gender",
        "createdAt": "2015-09-25T15:42:14.445Z",
        "objectId": "eyhRa6vScg",
        "updatedAt": "2015-09-25T15:59:18.748Z"
    },
	{
        "DREAM_MEANING": "This dream symbol might imply your feelings in life, you might be at a crossroad and not sure what way to go.",
        "DREAM_TERM": "crossroads",
        "createdAt": "2015-09-19T07:20:50.845Z",
        "objectId": "ez9GeVzeRo",
        "updatedAt": "2015-09-19T07:20:59.389Z"
    },
	{
        "DREAM_MEANING": "This could be a symbol of emotional disturbances that you may be or will be experiencing in the near future.  Water represents our emotions and if that is the case then you might be in for a rocky ride.",
        "DREAM_TERM": "waves",
        "createdAt": "2015-09-20T04:04:08.426Z",
        "objectId": "f0eQ4jxbHY",
        "updatedAt": "2015-09-20T04:04:13.096Z"
    },
	{
        "DREAM_MEANING": " If your dreaming about getting a manicure done on your hands means that your feeling good about yourself. Its possible that all your hard work is now paying off.",
        "DREAM_TERM": "manicure",
        "createdAt": "2015-09-19T23:55:42.698Z",
        "objectId": "fF1ADQaIiz",
        "updatedAt": "2015-09-19T23:55:45.893Z"
    },
	{
        "DREAM_MEANING": "Eating or seeing jelly in your dream means that you are learning about something that you were trying to understand before.",
        "DREAM_TERM": "jelly",
        "createdAt": "2015-09-19T22:41:47.491Z",
        "objectId": "fHroEN7TMm",
        "updatedAt": "2015-09-19T22:41:52.576Z"
    },
	{
        "DREAM_MEANING": "Believe it or not dreams of this nature are usually not directed at financial issues.  According to dream experts these dreams relate to a sexual desire in your life.  Gold coins would imply attraction  in men and silver coins attraction in women.  Some say it has to do with energy. If you are finding money or losing it might suggest you need or have some.",
        "DREAM_TERM": "money",
        "createdAt": "2015-09-19T23:58:59.884Z",
        "objectId": "fMxVTCBvnq",
        "updatedAt": "2015-09-19T23:59:01.905Z"
    },
	{
        "DREAM_MEANING": "If you not being accepted in your dream suggest that your show push over tendencies in your walking life.  You need to be more assertive and not feeling a part of the team. Though being accepted in your dream represents your own self pride and confidence around others.",
        "DREAM_TERM": "acceptance",
        "createdAt": "2015-09-19T06:40:56.032Z",
        "objectId": "fTFg05fiC9",
        "updatedAt": "2015-09-19T06:41:46.377Z"
    },
	{
        "DREAM_MEANING": "An eclipse indicates a short spurt of darkness in your life that you will quickly overcome. Pay close attention to new random encounters in your waking life. If you dream of a solar eclipse, it means that you have doubts about your talents and what you can do in your life but stay strong, you will get rid of those doubting thoughts. If you dream of a lunar eclipse it could mean that you are undergoing menstruation or menopause. Dreaming that the eclipse has finished suggests that you are experiencing some sort of enlightenment.",
        "DREAM_TERM": "Eclipse",
        "createdAt": "2015-09-25T15:31:30.306Z",
        "objectId": "ffMUqNZi6L",
        "updatedAt": "2015-09-25T15:35:19.649Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a name means you are thinking that person or someone they represent lately, pay attention to the other symbols in your dream to understand why you dreamt the name. You may be picking up on something about them. If you forget your name or someone elses name in your dream it indicates that the pressures of your life are causing you to be distressed. ",
        "DREAM_TERM": "name",
        "createdAt": "2015-09-20T00:01:42.230Z",
        "objectId": "ffRBTNajAa",
        "updatedAt": "2015-09-20T00:01:46.439Z"
    },
	{
        "DREAM_MEANING": "Dreaming of performing yoga in your dream either means you have a good balance between stress and relaxation or the total opposite. Pay attention to whether you are letting daily stresses get to you.",
        "DREAM_TERM": "yoga",
        "createdAt": "2015-09-20T04:11:36.065Z",
        "objectId": "frgOLUVZ3a",
        "updatedAt": "2015-09-20T04:11:37.953Z"
    },
	{
        "DREAM_MEANING": "If you are stressed in your waking life, look out for the images and symbols that is causing you fear in your dreams because thats your answer to your problems with stress. Fearful dreams are a sign of stress and you are overloading your brain so try managing your problems, stress could cause many problems in life.",
        "DREAM_TERM": "Fear",
        "createdAt": "2015-09-25T15:41:32.430Z",
        "objectId": "g460v0OmN4",
        "updatedAt": "2015-09-25T15:52:46.411Z"
    },
	{
        "DREAM_MEANING": "Dreaming of the uterus symbolizes how much you want children. If you are actually pregnant the dream represents your feelings of concern about the pregnancy.",
        "DREAM_TERM": "uterus",
        "createdAt": "2015-09-20T03:48:31.553Z",
        "objectId": "gFfKOcUUck",
        "updatedAt": "2015-09-20T03:48:34.010Z"
    },
	{
        "DREAM_MEANING": "Wow, no need to scream we hear you! The dream indicates feelings of anger that you have been holding back but you finally want to let it out! On the other hand, you may be yelling because you feel that no one is listening to you.",
        "DREAM_TERM": "yelling",
        "createdAt": "2015-09-20T04:10:46.064Z",
        "objectId": "gLHSXwSOm9",
        "updatedAt": "2015-09-20T04:10:47.903Z"
    },
	{
        "DREAM_MEANING": "Being numb in a dream implies that you are feeling uneasy and anxious about a situation. If you dream of being numb it means that you seem to be scared of new changes in your life.",
        "DREAM_TERM": "numbness",
        "createdAt": "2015-09-20T00:08:44.412Z",
        "objectId": "gP51qCgMhU",
        "updatedAt": "2015-09-20T00:08:47.075Z"
    },
	{
        "DREAM_MEANING": "In a dream it is the total opposite of drought, it means you are drowning with emotions and they have become too much to bare. If someone is trying to drown you then you need to examine your associations in life and see which one is causing you distress or a vast amount of emotions.",
        "DREAM_TERM": "drowning",
        "createdAt": "2015-09-19T07:32:33.290Z",
        "objectId": "gSroeJQszl",
        "updatedAt": "2015-09-19T07:32:35.382Z"
    },
	{
        "DREAM_MEANING": "The wolf is a common motif in the foundational mythologies for many years.  This powerful symbol could translate to teaching, guidance, friendship, loyalty and intuition.",
        "DREAM_TERM": "wolf",
        "createdAt": "2015-09-20T04:06:21.227Z",
        "objectId": "gb8UdCOhM1",
        "updatedAt": "2015-09-20T04:06:23.226Z"
    },
	{
        "DREAM_MEANING": "Walking freely and knowing where you are heading means that you are on the right path in your waking life. Pay attention to where you are destined to in your dream, try and relate it to your life.\nIf you are having problems walking, it suggests that you are a bit confused and not sure uncertain about your direction in life. Also you may be trying to ignore or hide from something in your life. Take heed of what you are having difficulty pursuing or why you are unable to progress forward because it serves as a representation of your waking situation",
        "DREAM_TERM": "walking",
        "createdAt": "2015-09-20T04:01:45.819Z",
        "objectId": "gbVNvBRmDf",
        "updatedAt": "2015-09-20T04:01:47.903Z"
    },
	{
        "DREAM_MEANING": "Oh the day of love! When you dream of this day it suggests that you are making progress in your love life. On the other hand, the dream denotes that you should show your love for others in your life and not take the for granted.",
        "DREAM_TERM": "valentines day",
        "createdAt": "2015-09-20T03:50:14.960Z",
        "objectId": "ggeAYrK2Rk",
        "updatedAt": "2015-09-20T03:50:16.997Z"
    },
	{
        "DREAM_MEANING": "Having a dream where you escape from some sort of imprisonment is symbolic to a situation that has you feeling held back and tied up but you want to flee. A dream about escaping from someone who has kidnapped you is your desire to get rid of that relationship that is holding you down or controlling you. If you are chained, handcuffed or tied up in anyway and you escape it means you are going to work out difficulties.If you escape from the law in some way it means you are afraid of being blamed for something that you did not do. If someone escapes from you it indicates you are afraid to lose someone that you care about and means a lot to you.",
        "DREAM_TERM": "Escape",
        "createdAt": "2015-09-25T15:38:30.677Z",
        "objectId": "gpobhztMH9",
        "updatedAt": "2015-09-25T15:47:34.774Z"
    },
	{
        "DREAM_MEANING": "Ham is a form of nourishment and providing energy. If you are eating ham in your dream then you need energy in your waking life. If you just see ham then you need to learn how to indulge in emotional impulses.",
        "DREAM_TERM": "Ham",
        "createdAt": "2015-09-25T15:42:52.527Z",
        "objectId": "guK85uZUCX",
        "updatedAt": "2015-09-25T16:03:24.026Z"
    },
	{
        "DREAM_MEANING": "Death and murder may not be all that bad as a dream symbol but maybe a good one.  If you where murdered maybe an old part of you has been killed and now its time for a new person.  Depending the context it can change so we think you should come to our forum and post your death dream so it can be analyzed.",
        "DREAM_TERM": "murder",
        "createdAt": "2015-09-20T00:00:42.003Z",
        "objectId": "hLd1NCvjig",
        "updatedAt": "2015-09-20T00:00:44.894Z"
    },
	{
        "DREAM_MEANING": "When you dream of yourself in an igloo it represents how you portray yourself to others. You appear to have a cold attitude but you are really caring and have a warm heart. If someone else is in the igloo, you should stop judging someone and get to know them, dont judge a book by its cover!",
        "DREAM_TERM": "igloo",
        "createdAt": "2015-09-19T22:32:47.975Z",
        "objectId": "hVEaH43YW0",
        "updatedAt": "2015-09-19T22:32:52.584Z"
    },
	{
        "DREAM_MEANING": "Think of yourself as a caterpillar going into its cocoon ready to turn into a butterfly. To dream of this season means that you are finally paying off for all your hard work and you will have a new beginning.",
        "DREAM_TERM": "Fall",
        "createdAt": "2015-09-25T15:40:49.901Z",
        "objectId": "hv75lfPQGU",
        "updatedAt": "2015-09-25T15:49:18.435Z"
    },
	{
        "DREAM_MEANING": "When you dream of being underwater it means that your emotions, about a specific problem, are overwhelming you.",
        "DREAM_TERM": "underwater",
        "createdAt": "2015-09-20T03:45:21.218Z",
        "objectId": "i0cv57ij0P",
        "updatedAt": "2015-09-20T03:45:23.086Z"
    },
	{
        "DREAM_MEANING": "A dream about a hammer suggests that something needs to get done and it needs a lot of work to be completed. If you are using the hammer then you are determined to put the work in to get things done.",
        "DREAM_TERM": "Hammer",
        "createdAt": "2015-09-25T15:42:54.139Z",
        "objectId": "iMGh0halvh",
        "updatedAt": "2015-09-25T16:03:14.216Z"
    },
	{
        "DREAM_MEANING": "A dream of a hamster is representative of your ability to understand your emotions and you know the difference between infatuation and love when it comes to your sex life.",
        "DREAM_TERM": "Hamster",
        "createdAt": "2015-09-25T15:42:55.787Z",
        "objectId": "iTPMVODoDG",
        "updatedAt": "2015-09-25T16:03:04.271Z"
    },
	{
        "DREAM_MEANING": "Colors hold different meanings depending the context, location and feeling in your dream. (More details in entry)",
        "DREAM_TERM": "colors",
        "createdAt": "2015-09-19T07:21:59.126Z",
        "objectId": "iTl5XuyNmS",
        "updatedAt": "2015-09-19T07:22:17.700Z"
    },
	{
        "DREAM_MEANING": "Could the alien be an unknown aspect of yourself that you recently discovered?  Do you feel alienated in your walking life?  Could this be a dream where you think the people around you could all be different than you? ",
        "DREAM_TERM": "alien",
        "createdAt": "2015-09-19T06:56:19.561Z",
        "objectId": "iqQQUTPFFL",
        "updatedAt": "2015-09-19T06:56:22.343Z"
    },
	{
        "DREAM_MEANING": "Deserts are symbols for bad luck or lack something whether it is companionship or hope. Roaming the desert can stand for being deserted or alone without any purpose in life but if you feel the adventure and excitement in it, it signifies your yearning for a new experience.",
        "DREAM_TERM": "desert",
        "createdAt": "2015-09-19T07:28:02.912Z",
        "objectId": "itggc9f3Rj",
        "updatedAt": "2015-09-19T07:28:05.105Z"
    },
	{
        "DREAM_MEANING": "Hail is frozen water that hurts when it falls on you. When you dream of it falling all around you then it means that you feel attacked in some situation and it is bringing you down emotionally. If you are inside listening to the hail falling on the roof then you are trying to avoid these feelings that you are experiencing due to the problems in your life because you know it is only going to be temporary.",
        "DREAM_TERM": "Hail",
        "createdAt": "2015-09-25T15:42:47.615Z",
        "objectId": "jC9O0FvC3A",
        "updatedAt": "2015-09-25T16:04:59.114Z"
    },
	{
        "DREAM_MEANING": "ake the challenge and jump for the stars. Your dream suggests that you jump for things as they come because you are capable of dealing with the hindrance in your way to success. Otherwise it could mean that you are moving too fast and “jumping the gun.” Slow down a bit and let things take its course.\nIf you are afraid to make the jump or fail at it suggests that you are afraid of change or not being able to do well in life.",
        "DREAM_TERM": "jumping",
        "createdAt": "2015-09-19T22:46:32.525Z",
        "objectId": "jPzfSLLHm7",
        "updatedAt": "2015-09-19T22:46:38.331Z"
    },
	{
        "DREAM_MEANING": "How do you describe this monster?  Could this monster be your fear built up over time you keep running from?  Where is this monster and why does he want you?",
        "DREAM_TERM": "monster",
        "createdAt": "2015-09-19T23:59:12.403Z",
        "objectId": "jcmOiPWx2U",
        "updatedAt": "2015-09-19T23:59:15.270Z"
    },
	{
        "DREAM_MEANING": "Dreaming of bathrooms, represents how we feel about ourselves inside and our instinctual urges. See entry for more details.",
        "DREAM_TERM": "bathrooms",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:03:32.276Z",
        "objectId": "jhAUVOIW76",
        "updatedAt": "2015-09-19T07:04:54.720Z"
    },
	{
        "DREAM_MEANING": "Dreaming of zigzags denotes a crazy and inconsistent character.",
        "DREAM_TERM": "zigzag",
        "createdAt": "2015-09-20T04:13:00.076Z",
        "objectId": "k6nbhNREp6",
        "updatedAt": "2015-09-20T04:13:02.419Z"
    },
	{
        "DREAM_MEANING": "Dreaming about waffles shows you have to be more realistic with your thoughts in your waking life. It could also mean that you cannot make up your mind in important decisions.\nFurthermore it could signify that you need to be more confident and assertive with your ideas and thoughts.",
        "DREAM_TERM": "waffle",
        "createdAt": "2015-09-20T03:59:18.674Z",
        "objectId": "kTHuXlCtnN",
        "updatedAt": "2015-09-20T03:59:21.589Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a clean napkin symbolizes your ability to keep a clean and untarnished reputation and environment around you. However, if the napkin is dirty it means that you are not heading down the right path and you’d soon cause trouble for yourself.",
        "DREAM_TERM": "napkin",
        "createdAt": "2015-09-20T00:02:29.154Z",
        "objectId": "kUJTN3LNLZ",
        "updatedAt": "2015-09-20T00:02:31.349Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a volcano represents your inability to deal with your feelings. If you see a volcanic eruption then you are experiencing anger towards a situation. Be careful how you release your feelings because you might do more hurt than anything. On the other hand, if the volcano is settled then so is your mind.",
        "DREAM_TERM": "volcano",
        "createdAt": "2015-09-20T03:56:59.522Z",
        "objectId": "kUK1KrAQHr",
        "updatedAt": "2015-09-20T03:57:04.023Z"
    },
	{
        "DREAM_MEANING": "When we dream of acid it represents all the bad emotions we have inside us.  Its symbolizes hate, anger, temper, revenge and a loss of control. If you have some aspects of acid you need to take some steps back and reflect on your emotions and how to control them.  Its possible if somebody in your life is toxic you may dream of being around it as well.",
        "DREAM_TERM": "acid",
        "createdAt": "2015-09-19T06:57:45.441Z",
        "objectId": "kaZwWmXeR7",
        "updatedAt": "2015-09-19T06:58:48.495Z"
    },
	{
        "DREAM_MEANING": "Moving up in a dream means that things are emerging from your unconscious. On the other hand it means that you are pulling yourself up out of a situation that was bringing your down in life.",
        "DREAM_TERM": "up",
        "createdAt": "2015-09-20T03:47:33.742Z",
        "objectId": "kbLyG4HyWB",
        "updatedAt": "2015-09-20T03:47:36.273Z"
    },
	{
        "DREAM_MEANING": "Finding yourself lost in a jungle in your dream indicates a pessimistic attitude in life is going to get you nowhere. If you learn to understand your jungle you would find your way out. If you are just wandering the jungle it implies your personality and characteristics that you cannot seem to release.",
        "DREAM_TERM": "jungle",
        "createdAt": "2015-09-19T22:47:01.482Z",
        "objectId": "kf4NS9a9Td",
        "updatedAt": "2015-09-19T22:47:06.712Z"
    },
	{
        "DREAM_MEANING": "You might need to cut of something within yourself that could be causing some grief.  Finding out what body part that was amputated in your dream might give you a hint of what to look out for.",
        "DREAM_TERM": "amputation ",
        "createdAt": "2015-09-19T06:55:44.939Z",
        "objectId": "kg9GQfipxs",
        "updatedAt": "2015-09-19T06:55:48.987Z"
    },
	{
        "DREAM_MEANING": "Oatmeal is symbolic of power and being able to handle things that come your way. If you are eating oatmeal it means that you are in control of yourself and know what you want in life. IF you are making oatmeal for someone else it represents you are in charge of and responsible for someones future.",
        "DREAM_TERM": "oatmeal",
        "createdAt": "2015-09-20T00:09:36.022Z",
        "objectId": "kl08vhXSdx",
        "updatedAt": "2015-09-20T00:09:38.834Z"
    },
	{
        "DREAM_MEANING": "Dreaming of giving affection implies your good heart and a you’re nice nature to help others.",
        "DREAM_TERM": "affection",
        "createdAt": "2015-09-19T06:46:39.396Z",
        "objectId": "knF7f5O5y0",
        "updatedAt": "2015-09-19T06:46:41.872Z"
    },
	{
        "DREAM_MEANING": "A dream about having fun and enjoying games signifies that you should relax a bit and kick back, have some fun in your life and stop stressing so much.",
        "DREAM_TERM": "Games",
        "createdAt": "2015-09-25T15:41:43.716Z",
        "objectId": "ksdww8r8cr",
        "updatedAt": "2015-09-25T15:57:06.927Z"
    },
	{
        "DREAM_MEANING": "To see yourself being part of a gang in a dream symbolizes your desire to be more powerful and threatening in order to get what you want. If you battle with a gang or a gang wants to face you then you are stressed with things in life.",
        "DREAM_TERM": "Gang",
        "createdAt": "2015-09-25T15:41:44.425Z",
        "objectId": "kyEAz1eeBT",
        "updatedAt": "2015-09-25T15:57:13.068Z"
    },
	{
        "DREAM_MEANING": "A halo is representative of angelic attributes and enlightenment. It could also mean that you are trying to attain these perfect characteristics that we believe exist in angels.",
        "DREAM_TERM": "Halo",
        "createdAt": "2015-09-25T15:42:51.890Z",
        "objectId": "l19r5kwyhr",
        "updatedAt": "2015-09-25T16:03:33.362Z"
    },
	{
        "DREAM_MEANING": "Cutting your hair in a dream is similar to making hairstyle changes. The dream is suggesting that you are changing your ways of thinking. If someone is cutting your hair it implies that you feeling weakened or brought down by someone. It also mean chopping off the past, getting rid of those dead ends to start a new.",
        "DREAM_TERM": "Haircut",
        "createdAt": "2015-09-25T15:42:49.068Z",
        "objectId": "lC2TLhiGNJ",
        "updatedAt": "2015-09-25T16:03:52.813Z"
    },
	{
        "DREAM_MEANING": "If you dream about being on your mattress means that you need time alone. You are over work and need a break.",
        "DREAM_TERM": "mattress",
        "createdAt": "2015-09-19T23:56:22.613Z",
        "objectId": "lHBrD9jZSB",
        "updatedAt": "2015-09-19T23:56:25.865Z"
    },
	{
        "DREAM_MEANING": "When you dram of a game show you should pay attention to the name of it and what you are trying to win. Use this information and see what it means to you in your life. Usually dreams like this indicate that you need to make some alterations and trying and figure out why you are so worried about your future.",
        "DREAM_TERM": "Game Show",
        "createdAt": "2015-09-25T15:41:42.609Z",
        "objectId": "ledhQ58xj7",
        "updatedAt": "2015-09-25T15:57:00.679Z"
    },
	{
        "DREAM_MEANING": "When you dream of urinating it indicates you are releasing your negativity. If you are unable to control the direction of your urine it signifies your lack of power in your life.",
        "DREAM_TERM": "urination",
        "createdAt": "2015-09-20T03:47:58.887Z",
        "objectId": "lfDDLylkSg",
        "updatedAt": "2015-09-20T03:48:00.853Z"
    },
	{
        "DREAM_MEANING": "An electric guitar represents your itching desire to let loose and rebel. To play one in your dream means that you are able to express yourself to people.",
        "DREAM_TERM": "Electric Guitar",
        "createdAt": "2015-09-25T15:36:34.336Z",
        "objectId": "lkZV247DEc",
        "updatedAt": "2015-09-25T15:44:50.406Z"
    },
	{
        "DREAM_MEANING": "When you dream of neon lights, it represents your longing to be famous. Otherwise, if there is a message written in neon lights, take head of it\nbecause your unconscious is trying to relay a message.",
        "DREAM_TERM": "neon light",
        "createdAt": "2015-09-20T00:05:13.301Z",
        "objectId": "lsmuD4y0sk",
        "updatedAt": "2015-09-20T00:05:15.146Z"
    },
	{
        "DREAM_MEANING": "Wearing or seeing pyjamas in your dream indicates that you have been denying yourself any recreation but it is needed. If you wear the pyjamas in public it implies you are not paying attention to things that are right in front of you.",
        "DREAM_TERM": "pyjamas",
        "createdAt": "2015-09-20T00:21:41.108Z",
        "objectId": "lyzkoiL5Nh",
        "updatedAt": "2015-09-20T00:21:43.055Z"
    },
	{
        "DREAM_MEANING": "When we dream of a beach its is a very important dream symbol that shouldn’t be ignored. Dreaming of relaxing on a beach might be the unconscious mind telling you that you need a break from your daily activities. (More details in entry)",
        "DREAM_TERM": "beach",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:05:52.577Z",
        "objectId": "mIYh8QlEoa",
        "updatedAt": "2015-09-19T07:06:40.950Z"
    },
	{
        "DREAM_MEANING": "What is melting in your dream? If you remember what was melting in your dream would help understand what need caring for. Something in your life is melting away and might disappear.",
        "DREAM_TERM": "melting",
        "createdAt": "2015-09-19T23:56:57.800Z",
        "objectId": "mQLzNVgGI6",
        "updatedAt": "2015-09-19T23:57:01.689Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a yarn signifies routine. You are tired of the same thing every day. If the yarn is twisted or disheveled it suggests that you are a bit confused and stuck in a condition.",
        "DREAM_TERM": "yarn",
        "createdAt": "2015-09-20T04:09:36.654Z",
        "objectId": "nJIJlKnN9n",
        "updatedAt": "2015-09-20T04:10:03.670Z"
    },
	{
        "DREAM_MEANING": "A dream of you telling a joke represents how people perceive you but you want them to take you seriously. Alternatively you could be the one who cannot stop fooling around and take your responsibilities seriously.",
        "DREAM_TERM": "joke",
        "createdAt": "2015-09-19T22:45:23.701Z",
        "objectId": "nPQ4CJj1WQ",
        "updatedAt": "2015-09-19T22:45:31.732Z"
    },
	{
        "DREAM_MEANING": "Very significant dream symbols. (MUST READ ENTRY)",
        "DREAM_TERM": "chased",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:17:35.993Z",
        "objectId": "nUiJVQlBVP",
        "updatedAt": "2015-09-19T07:18:23.522Z"
    },
	{
        "DREAM_MEANING": "A hate symbolizes protection of the head and thoughts. If you change your hats in your dream it indicates that you are confused and have many conflicting ideas lately.\n\nIf you are wearing a hat in your dream it denotes that you are keeping certain characteristics a secret and concealed for no one to see. If you wear different hats then it represents your different tasks and positions you play in your life.\n\nA top hat symbolizes status and prosperity. If you lose the top hat it means you are fearful of losing your rank and power in life.",
        "DREAM_TERM": "Hat",
        "createdAt": "2015-09-25T15:42:58.849Z",
        "objectId": "nYfbDC4HUp",
        "updatedAt": "2015-09-25T16:02:34.918Z"
    },
	{
        "DREAM_MEANING": "Does a jeep mean anything to you? If not the dream is just telling you to be a bit more exciting and daring with your life even with sex.",
        "DREAM_TERM": "jeep",
        "createdAt": "2015-09-19T22:41:29.254Z",
        "objectId": "o2CUmnbrtJ",
        "updatedAt": "2015-09-19T22:41:35.187Z"
    },
	{
        "DREAM_MEANING": " Dreaming that you are in a parachute signifies that you have a shield over you. Whether it be invisible or some energy that is unexplainable, something is keeping you safe. If your parachute is giving problems and cannot open then you feel that you cannot trust anyone and whoever you felt would keep you safe has left you on your own.",
        "DREAM_TERM": "parachute",
        "createdAt": "2015-09-20T00:17:27.426Z",
        "objectId": "o6L3vcJuHS",
        "updatedAt": "2015-09-20T00:17:29.503Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a devil could represent conflicts you are having with yourself; it may be negativity, guilt or worrying about a situation. These feelings come out in your dream in the form of the devil.",
        "DREAM_TERM": "devil",
        "createdAt": "2015-09-19T07:28:41.971Z",
        "objectId": "oBn3TJfkeR",
        "updatedAt": "2015-09-19T07:28:44.166Z"
    },
	{
        "DREAM_MEANING": "When you have or see lunch in your dream it indicates your body needs some form of nourishment and energy.",
        "DREAM_TERM": "lunch",
        "createdAt": "2015-09-19T23:00:43.648Z",
        "objectId": "oNYaO1Cajt",
        "updatedAt": "2015-09-19T23:00:49.181Z"
    },
	{
        "DREAM_MEANING": "Dreaming of being handcuffed represents your feelings of being tied down to a situation or being held back and suppressed. You feel like if someone is being possessive of you. On the other hand, if someone else is being handcuffed or you are handcuffing someone it means that you are being too controlling and over protective of others.",
        "DREAM_TERM": "Handcuffs",
        "createdAt": "2015-09-25T15:42:58.206Z",
        "objectId": "oSePVVQX40",
        "updatedAt": "2015-09-25T16:02:42.213Z"
    },
	{
        "DREAM_MEANING": "Pay close attention to how the sculpture in your dream is shaped and apply it to how and what it could stand for in your life. The dream means that you cannot progress with your current emotional state.",
        "DREAM_TERM": "ice sculpture",
        "createdAt": "2015-09-19T22:28:50.238Z",
        "objectId": "oYD046ucpf",
        "updatedAt": "2015-09-19T22:29:04.142Z"
    },
	{
        "DREAM_MEANING": "A fax machine acts is like text messaging in reality, it is you unconscious way of communicating messages to you that you do not notice in your waking life. If you receive a message, pay close attention to it because someone is trying to reach you. If you are sending a fax but it is not going through because of whatever malfunction it means you are looking for a way to send a message to someone but you are fearful of the response or you are not using the right method of expressing yourself. If it is not sending because of no paper it means you are fed up because you do not know what else to say in a situation.",
        "DREAM_TERM": "Fax Machine",
        "createdAt": "2015-09-25T15:41:31.478Z",
        "objectId": "oaqDqzGbbY",
        "updatedAt": "2015-09-25T15:52:40.750Z"
    },
	{
        "DREAM_MEANING": "Dreaming of lips is indicative to speech and intimacy. If your lips are sealed then you are not willing to communicate. Alternatively, if your lips are moving then, you want others to understand and listen to you.  If you dream of black lips it implies that you are not uttering a word about what is going on. Your lips are sealed.",
        "DREAM_TERM": "lips",
        "createdAt": "2015-09-19T22:58:57.318Z",
        "objectId": "okoeegMDBM",
        "updatedAt": "2015-09-19T22:58:59.412Z"
    },
	{
        "DREAM_MEANING": "Needles in your dream represent something in your life that needs to be fixed and sewn back together. On the other hand, the needle could symbolize the male penis. If you saw knitting needles it means that you are going to operate things in a witty way to get your desired outcome.",
        "DREAM_TERM": "needles",
        "createdAt": "2015-09-20T00:04:25.236Z",
        "objectId": "p4CYyMSML4",
        "updatedAt": "2015-09-20T00:04:27.387Z"
    },
	{
        "DREAM_MEANING": "Dreaming of being in this state means you are in the same condition in your waking life.  Regain control over your senses and know you can get it together!",
        "DREAM_TERM": "panic",
        "createdAt": "2015-09-20T00:16:49.915Z",
        "objectId": "p69NNyytOq",
        "updatedAt": "2015-09-20T00:16:52.189Z"
    },
	{
        "DREAM_MEANING": "An escalator is similar to an elevator but not as important and symbolic. You are moving through different levels of your consciousness. Going up on the escalator means that you are moving forward in life and challenging yourself to reach higher goals. Whether it is deeper in tune with your spirituality or being promoted at work, going up an escalator is a very good sign. Even if you are looking down while going up it means that you will look at things from a prospective to allow you to excel in the situation. If you are going down the escalator it symbolizes you are getting to the bottom of things and going further down into memories and thoughts of your unconscious.\nIf the escalator has stopped moving it means you will be facing an obstacle.",
        "DREAM_TERM": "Escalator",
        "createdAt": "2015-09-25T15:38:25.859Z",
        "objectId": "p87nUQTlMK",
        "updatedAt": "2015-09-25T15:47:28.902Z"
    },
	{
        "DREAM_MEANING": "When you dream of your own heart, a lot of people think it represents love but it also represents the heart of a situation. Think of what you are going through now and see if you need to dig deeper to get some more information on what is going on.\nIf your heart is bleeding or hurting in any way, the dream suggests depression and pain from some situation in your life.\nIf you have some heart surgery it implies that you are going to experience drastic changes in your associations with others.",
        "DREAM_TERM": "Heart",
        "createdAt": "2015-09-25T15:43:01.360Z",
        "objectId": "pRlM2tnyxm",
        "updatedAt": "2015-09-25T16:02:10.947Z"
    },
	{
        "DREAM_MEANING": "This symbol could mean you are unable to move the way in life you are supposed to.  You might feel stuck and want to free from restrictions possibly brought on by yourself.",
        "DREAM_TERM": "wheelchair",
        "createdAt": "2015-09-20T04:05:24.142Z",
        "objectId": "pjoaFn05HV",
        "updatedAt": "2015-09-20T04:05:26.473Z"
    },
	{
        "DREAM_MEANING": "May be telling you to get more \"Zzzzzs\" (sleep).",
        "DREAM_TERM": "z",
        "createdAt": "2015-09-20T04:15:25.616Z",
        "objectId": "plSPA0bVMC",
        "updatedAt": "2015-09-20T04:15:39.282Z"
    },
	{
        "DREAM_MEANING": "To be an actor or actress in your dream represents a need to enjoy life pleasures.  What type of roll are you playing?  By finding this out will help you find the traits that you are looking for in your life.",
        "DREAM_TERM": "actor",
        "createdAt": "2015-09-19T06:43:34.581Z",
        "objectId": "q1pctGiFzM",
        "updatedAt": "2015-09-19T06:43:48.633Z"
    },
	{
        "DREAM_MEANING": "Maps are good dream symbols that suggest that you have good direction in life. You will be successful in finding your way with organization and comfort.\nIf you loose your map or your lost with the map suggest that you need more guidance in life. You need help in finding yourself. The good news is that you are trying and will eventually get there, its just going to take a bit of time.",
        "DREAM_TERM": "map",
        "createdAt": "2015-09-19T23:55:58.564Z",
        "objectId": "qDenaAqDcg",
        "updatedAt": "2015-09-19T23:56:01.152Z"
    },
	{
        "DREAM_MEANING": "Being at the top, highest peak of a mountain suggests that you are going to reach your goals. You would do what you need to in life to excel and achieve what you want.",
        "DREAM_TERM": "peak",
        "createdAt": "2015-09-20T00:18:12.966Z",
        "objectId": "qUH4lC1YXs",
        "updatedAt": "2015-09-20T00:18:14.944Z"
    },
	{
        "DREAM_MEANING": "Seeing a head in your dream represents intuition and knowledge. If someone is trying to take your head of it suggests that you are not looking at things in the right way. Whatever problem is causing you trouble you should pay attention to the facts and truth and stop letting your vision be blurred.\n\nIf you have two heads in your dream it means that you need to allow others to help you out. Sometimes others could help us better than we can help ourselves. Also two minds work quicker than one.",
        "DREAM_TERM": "Head",
        "createdAt": "2015-09-25T15:42:59.710Z",
        "objectId": "qckCwdjaV4",
        "updatedAt": "2015-09-25T16:02:25.496Z"
    },
	{
        "DREAM_MEANING": " Is the pan hot or is it in the cupboard? If the pan is hot then it represents anger towards a situation. If it is not then it means that you are open to others giving their opinions about you whether it be good or bad.",
        "DREAM_TERM": "pan",
        "createdAt": "2015-09-20T00:16:13.325Z",
        "objectId": "qqVgkyPxNG",
        "updatedAt": "2015-09-20T00:16:15.702Z"
    },
	{
        "DREAM_MEANING": "Dreaming of birds can mean a whole bunch of things.  You may want to break it down into detail to better understand the true meaning of what the dream means.  Bird dreams all vary on the colour, size, mass and your feeling in the dream. (More details under its entry)",
        "DREAM_TERM": "birds",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:07:42.231Z",
        "objectId": "qrVWhLY2Ul",
        "updatedAt": "2015-09-19T07:08:13.512Z"
    },
	{
        "DREAM_MEANING": "When ever we dream of cages it has everything to do with being trapped in your walking life.",
        "DREAM_TERM": "cage",
        "createdAt": "2015-09-19T07:12:12.427Z",
        "objectId": "rCujCXpwiU",
        "updatedAt": "2015-09-19T07:12:14.829Z"
    },
	{
        "DREAM_MEANING": "An urn is representative of your past. Consider the lyrics let it burn, you have been hurt by something but you know you had to burn it and move on. You may feel that this was done to you.",
        "DREAM_TERM": "urn",
        "createdAt": "2015-09-20T03:48:14.872Z",
        "objectId": "rGRlyUIGX8",
        "updatedAt": "2015-09-20T03:48:17.542Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a maze can mean different things depending on the dream. Where you lost in the maze. If you where lost and scared in the maze suggest that you feel trapped in your walking life. If you get out of the maze with ease implies that you will get out of a tuff situation with out any trouble.",
        "DREAM_TERM": "maze",
        "createdAt": "2015-09-19T23:56:42.439Z",
        "objectId": "rIGy26c3C6",
        "updatedAt": "2015-09-19T23:56:44.672Z"
    },
	{
        "DREAM_MEANING": "To dream of eloping means you are trying to hide from some difficulties youve been faced with. You do not want to conclude things so you think hiding for the moment would help make things easier. If your elopement is stopped, it means youve been caught and you need to rethink recent decisions and be certain its what you want to do.",
        "DREAM_TERM": "Elopement",
        "createdAt": "2015-09-25T15:36:58.288Z",
        "objectId": "rLQjX47IaG",
        "updatedAt": "2015-09-25T15:45:51.772Z"
    },
	{
        "DREAM_MEANING": " Vampires a very sexual dream symbols. You feel hurt or taken advantage of in some sexual relationship. On the other hand, you unconscious is probably trying to warn about someone in your life who is luring you easily with their charisma but will hurt you eventually. You know this but you are trying to fight it because you either care for this person or too insecure to know that you deserve better. Alternatively if you are having contradicting thoughts about having sex the dream refers to the fact that you are letting someone force you into it. If you are a vampire then you are forcing people to do things you want and hurting them without caring.",
        "DREAM_TERM": "vampire",
        "createdAt": "2015-09-20T03:50:54.232Z",
        "objectId": "rf1P7VRVZ8",
        "updatedAt": "2015-09-20T03:50:57.083Z"
    },
	{
        "DREAM_MEANING": "Military dreams are our way of telling us that we need some type of order in our lives. You need somebody to tell you what to do and give you direction. ",
        "DREAM_TERM": "military",
        "createdAt": "2015-09-19T23:57:54.184Z",
        "objectId": "sNUiFY02ya",
        "updatedAt": "2015-09-19T23:57:56.351Z"
    },
	{
        "DREAM_MEANING": "Do you have a daughter? Well your daughter needs you to show her interest or needs some parental guidance if you dream about her. If you do not have a daughter but dream of one, think of yourself as the daughter because she represents your youthfulness.",
        "DREAM_TERM": "daughter",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:25:04.339Z",
        "objectId": "sO3FGPvLzU",
        "updatedAt": "2015-09-19T07:25:10.541Z"
    },
	{
        "DREAM_MEANING": "Being drunk in your dream means that your actions are thoughtless you are trying to run away from reality.",
        "DREAM_TERM": "drunk",
        "createdAt": "2015-09-19T07:32:48.949Z",
        "objectId": "sUux8gGQ1k",
        "updatedAt": "2015-09-19T07:32:50.649Z"
    },
	{
        "DREAM_MEANING": "When you dream of an email message to you or from you is represents that you need to reach out to someone who is distant at times. It could also mean that you are not too close with the person; you keep a distance in your relationship with them. If you receive an email, someone is trying to communicate with you when you are conscious.",
        "DREAM_TERM": "Email",
        "createdAt": "2015-09-25T15:37:05.136Z",
        "objectId": "snZqLdOOXH",
        "updatedAt": "2015-09-25T15:46:06.232Z"
    },
	{
        "DREAM_MEANING": "Dreams of ice cubes signify cold emotions that you have been storing up.",
        "DREAM_TERM": "ice cube",
        "createdAt": "2015-09-19T22:27:38.656Z",
        "objectId": "sqnhtprc3o",
        "updatedAt": "2015-09-19T22:27:48.650Z"
    },
	{
        "DREAM_MEANING": "This dream symbol has to do with control in your life.  Depending if you are flying or not suggest how much control you have over your direction right now.\n",
        "DREAM_TERM": "pilot",
        "createdAt": "2015-09-20T00:20:42.484Z",
        "objectId": "sr1BYaE7mx",
        "updatedAt": "2015-09-20T00:20:57.548Z"
    },
	{
        "DREAM_MEANING": "When you dream of gasoline it is representative of your energy levels. If your car is running low on gas or you see or smell it then this means you need time to relax and think about for yourself for a bit. You should have a better handle on your health and situations that you are dealing with in your life.\nTo find yourself or someone else in a gas chamber represents some situation that is bringing you down and causing you to suffer.\nIf you are being protected from the gas by wearing a gas mask indicates your ability to know what is good for you and what is not. You are conscious of the fact that people are not giving you all the information they have.",
        "DREAM_TERM": "Gasoline",
        "createdAt": "2015-09-25T15:42:09.606Z",
        "objectId": "suJAw99EZ8",
        "updatedAt": "2015-09-25T15:58:30.863Z"
    },
	{
        "DREAM_MEANING": "Could this a reflection of yourself?  What do you see?  Dreams of this meaning can change depending on the context but for the most part symbolizes intellect.  To many dream experts they say it represents a magical meaning, almost like the knowing mirror.  Again its really what you see and how you feel that can change the meaning.",
        "DREAM_TERM": "mirror",
        "createdAt": "2015-09-19T23:58:44.726Z",
        "objectId": "t7UqrqIJYW",
        "updatedAt": "2015-09-19T23:58:46.869Z"
    },
	{
        "DREAM_MEANING": "Water is said to do with our emotional level.",
        "DREAM_TERM": "water",
        "createdAt": "2015-09-20T04:03:39.200Z",
        "objectId": "t8X2hnpDNi",
        "updatedAt": "2015-09-20T04:03:41.608Z"
    },
	{
        "DREAM_MEANING": "Do you feel the need to protect yourself? If you dream of doing karate it implies that you know what you want but you just need to focus a bit more to get there.",
        "DREAM_TERM": "karate",
        "createdAt": "2015-09-19T22:49:08.804Z",
        "objectId": "tShrD2TpOD",
        "updatedAt": "2015-09-19T22:49:12.317Z"
    },
	{
        "DREAM_MEANING": "A kiss is symbolic of affection and liking of someone or someone or something they represent. Pay close attention to what body part you kiss in the dream. If your dream ends before you get to kiss someone then it suggests insecurity and uncertainty of feelings that person has for you. You want to pursue a relationship with them but do not know how to do it.",
        "DREAM_TERM": "kissing",
        "createdAt": "2015-09-19T22:51:59.506Z",
        "objectId": "tXDOh11cRf",
        "updatedAt": "2015-09-19T22:52:01.708Z"
    },
	{
        "DREAM_MEANING": "A face depicts peoples emotions and personality, without a face we are almost senseless. If you see yourself without a face then you do not understand yourself properly and you may have lost your sense of your own identity. On the other hand, when you see a faceless character in your dream it represents your lack of ability to understand others.",
        "DREAM_TERM": "Faceless",
        "createdAt": "2015-09-25T15:40:23.157Z",
        "objectId": "teUWZUMbAN",
        "updatedAt": "2015-09-25T15:48:24.727Z"
    },
	{
        "DREAM_MEANING": "Dreaming of living luxuriously indicates you have a very extravagant lifestyle. If you have a habit of spending more money than you have, your dream is actually telling you to slow down and stop wasting your money.",
        "DREAM_TERM": "luxury",
        "createdAt": "2015-09-19T23:01:08.639Z",
        "objectId": "tk6twbqVvd",
        "updatedAt": "2015-09-19T23:01:12.419Z"
    },
	{
        "DREAM_MEANING": "You may need to make changes in your life that are causing you problems because signs of destruction in your dream, in whatever form it may come in, it means you need to burn the old and start afresh.",
        "DREAM_TERM": "destruction",
        "createdAt": "2015-09-19T07:28:22.468Z",
        "objectId": "tnjqquZqzU",
        "updatedAt": "2015-09-19T07:28:24.790Z"
    },
	{
        "DREAM_MEANING": "How are you playing?  Are you good or bad? This might help you figure out if you need to go back to your creative side.  It could have to do with  “key/keys or peeing”.",
        "DREAM_TERM": "piano",
        "createdAt": "2015-09-20T00:19:56.414Z",
        "objectId": "txYuNjONjx",
        "updatedAt": "2015-09-20T00:19:58.278Z"
    },
	{
        "DREAM_MEANING": "Being a victim in your dream refers to your feelings that people are taking advantage of you. You feel like you have no control Such dreams suggest that you are feeling powerless and helpless in a waking situation. Alternatively, the dream indicates that you are unwilling to take responsibility for your choices.",
        "DREAM_TERM": "victim",
        "createdAt": "2015-09-20T03:53:54.122Z",
        "objectId": "u2EMKObe0L",
        "updatedAt": "2015-09-20T03:53:56.335Z"
    },
	{
        "DREAM_MEANING": "A dream about being fat is similar to your dreams about fast food. It indicates that you are conscious of your weight and you feel like you been putting on a few pounds. If you are concentrating on a specific area of your body it indicates that you are not happy with your image in society. When you dream of someone else being fat it means you are going to be more successful and a bit of luck is going to be heading your way because you are going to profit in some aspect of your life. On the other hand it could mean that someone is exaggerating and bigging up their name a bit too much when really people like that are very self conscious.",
        "DREAM_TERM": "Fat",
        "createdAt": "2015-09-25T15:41:27.178Z",
        "objectId": "u2cQTaJay2",
        "updatedAt": "2015-09-25T15:52:07.494Z"
    },
	{
        "DREAM_MEANING": "Dreaming of failure is representative of your fear and worry of actually being unable to meet the standards of society of that you have made for yourself based on the pressures of society to excel. If you are not confident in your potential then youd have many dreams of failing. Failing in front of others is plain and simple about your appearance to society.\nA common dream that almost everyone has had is failing in school. This does not mean that you are going to fail, but it does represent your anxiety about overlooking something.\nTo dream that you go out of business or you are unsuccessful at doing your job is a sign of your fears of not being trained enough.\nDreaming of having a relationship that is not doing too well because of you is a warning that you need to step up and do something or else the relationship is going to fail in your waking life.",
        "DREAM_TERM": "Failure",
        "createdAt": "2015-09-25T15:40:33.294Z",
        "objectId": "uKqXsV74mp",
        "updatedAt": "2015-09-25T15:48:55.557Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a zookeeper means that you need someone to hold you back and help you keep your composure. Some situation in your life is causing you to be emotionally distraught and soon if you do not seek help, someone is going to do it without asking you.",
        "DREAM_TERM": "zookeeper",
        "createdAt": "2015-09-20T04:14:04.917Z",
        "objectId": "uV3xH5dgK2",
        "updatedAt": "2015-09-20T04:14:06.824Z"
    },
	{
        "DREAM_MEANING": "Dreaming of an earwig symbolizes bad news and not being able to handle it well. Someone or something is bugging you and will affect you until you get rid of it. It also suggests that you will not take constructive criticism wisely.",
        "DREAM_TERM": "Earwig",
        "createdAt": "2015-09-25T15:31:10.407Z",
        "objectId": "us9e36TBxX",
        "updatedAt": "2015-09-25T15:31:42.138Z"
    },
	{
        "DREAM_MEANING": "The dream serves as a metaphor meaning you need to catch up. You are far behind and need to start paying more attention to what needs to be done in your life.",
        "DREAM_TERM": "ketchup",
        "createdAt": "2015-09-19T22:49:58.033Z",
        "objectId": "v4FepepluV",
        "updatedAt": "2015-09-19T22:50:00.995Z"
    },
	{
        "DREAM_MEANING": "Love is an intense feeling, often confused with infatuation. When you dream of being in love it signifies how you feel towards someone in your waking life. You are happy with what and who you have in life. Otherwise, if you feel unloved in your life the dream is expressing your desire to be loved.",
        "DREAM_TERM": "love",
        "createdAt": "2015-09-19T23:00:04.541Z",
        "objectId": "v4JYg3fhMo",
        "updatedAt": "2015-09-19T23:00:06.840Z"
    },
	{
        "DREAM_MEANING": "When you dream of losing something, it suggests that you may have actually lost something or someone. You did not realise while you were conscious what happened. Alternatively it is a wakeup call for you to tidy up your life or else you won’t be able to find things. Furthermore, try and relate the lost item to a memory or person. Perhaps the dream represents lost feelings, chances and relationships.",
        "DREAM_TERM": "lose",
        "createdAt": "2015-09-19T22:59:31.748Z",
        "objectId": "vWXTfQVETD",
        "updatedAt": "2015-09-19T22:59:35.751Z"
    },
	{
        "DREAM_MEANING": "When you dream of a blank page it represents not being able to move forward or progress. You either keep procrastinating or you are just too lazy to try and lead a successful life.",
        "DREAM_TERM": "page",
        "createdAt": "2015-09-20T00:15:08.965Z",
        "objectId": "vd7QnbcDNY",
        "updatedAt": "2015-09-20T00:15:13.535Z"
    },
	{
        "AUTHOR": "Michael",
        "DREAM_MEANING": "To see an abdomen in your dream represents your gut feeling on a situation.  ",
        "DREAM_TERM": "abdomen",
        "createdAt": "2015-09-19T06:29:41.930Z",
        "objectId": "vfgImB2vaB",
        "updatedAt": "2015-09-19T06:38:05.892Z"
    },
	{
        "DREAM_MEANING": "May symbolize high or ultimate ideas and goals.",
        "DREAM_TERM": "zenith",
        "createdAt": "2015-09-20T04:14:58.295Z",
        "objectId": "vrwm9UPdrC",
        "updatedAt": "2015-09-20T04:15:01.568Z"
    },
	{
        "DREAM_MEANING": "Cemetery dreams are usually a good symbol that means “death” to old habits. You may have fully killed off some of your bad ways and now it’s time to move forward.",
        "DREAM_TERM": "cemetery",
        "createdAt": "2015-09-19T07:17:06.769Z",
        "objectId": "vs7uiWvJnY",
        "updatedAt": "2015-09-19T07:17:10.739Z"
    },
	{
        "DREAM_MEANING": " If you dream that you are getting an x-ray done implies deception and betrayal. Sometimes we are quick to trust people or situations by first appearance but you need to learn not to judge a book by its cover, open it up and read what’s inside. Alternatively it just means that you are actually examining and looking inside things that have been causing you problems.",
        "DREAM_TERM": "x-ray",
        "createdAt": "2015-09-20T04:07:18.730Z",
        "objectId": "vuVmBalcmQ",
        "updatedAt": "2015-09-20T04:07:22.450Z"
    },
	{
        "DREAM_MEANING": "A dream of insects indicates that someone or something is bothering you and causing you to have problems in your life. It is a pun on bugging therefore whatever is hindering you from moving forward, the attack would soon be over.",
        "DREAM_TERM": "insects",
        "createdAt": "2015-09-19T22:37:35.379Z",
        "objectId": "wEhSXHR4fh",
        "updatedAt": "2015-09-19T22:37:40.603Z"
    },
	{
        "DREAM_MEANING": "Dreams of this sort symbolize something or someone that resurfaced or was born again after they were considered dead. It could be deceased person or just a thought you buried.\nIf you communicate with a ghost in your dream and are not intimidated by it, this could be a very powerful symbol. It could mean someone has come from the spirit world to give you a message or warn you about something. On the other hand it could just mean that you are missing some quality or aspect of someone that died and was close with you. If you know for sure it is someone you knew then you may be trying to make resolution with something that was done when they were alive. Alternatively is could mean that the person just wants to tell you something that they never got to say before they died.\nOtherwise if you feel afraid when the ghost is present then you regret whatever you did in the past and it is coming back to haunt you. Your unconscious is trying to help you get rid of the guiltiness that has been lingering in your memory.\nIf you dream of someone who is still alive as a ghost then someone is attracted to you and you feel uneasy about it. They haven’t told you about but your unconscious is picking up on it.",
        "DREAM_TERM": "Ghost",
        "createdAt": "2015-09-25T15:42:32.957Z",
        "objectId": "wMEx6YejJ8",
        "updatedAt": "2015-09-25T15:56:33.797Z"
    },
	{
        "DREAM_MEANING": "An octopus in your dream suggests that you are disheveled by something. The octopus could also represent how you hold on to things or people and do not know how to let loose.",
        "DREAM_TERM": "octopus",
        "createdAt": "2015-09-20T00:11:48.455Z",
        "objectId": "wYPfGozzKZ",
        "updatedAt": "2015-09-20T00:11:50.647Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a covered wagon represents problems that are following you in daily life. Your hesitance in taking chances and your habit of being cheap money are drawn upon. As well it could symbolize that you have fallen behind on an agreement you made with yourself referring to the saying ‘fallen off the wagon’.  If the wagon is red it signifies thoughts of when you were a child, simple and carefree.\nSeeing a vacant wagon represents emptiness and unhappiness.",
        "DREAM_TERM": "wagon",
        "createdAt": "2015-09-20T04:01:06.537Z",
        "objectId": "wj7iBx7z6A",
        "updatedAt": "2015-09-20T04:01:09.280Z"
    },
	{
        "DREAM_MEANING": "Dreaming of having a disease does not necessarily mean that you actually have the disease. Diseases in your dream, cancer, AIDs, heart disease or the flu, indicate anxiety about a situation or fear that you have about actually getting the disease.(More details in entry)",
        "DREAM_TERM": "disease",
        "HAS_ENTRY": true,
        "createdAt": "2015-09-19T07:29:27.075Z",
        "objectId": "xJdJi0BYEl",
        "updatedAt": "2015-09-19T07:30:12.028Z"
    },
	{
        "DREAM_MEANING": "These dreams suggest a bond with that person you might be getting married too.  This could also suggest a long term partnership or tying the knot in some aspect in your life.  It is also possible you want to get married.",
        "DREAM_TERM": "wedding",
        "createdAt": "2015-09-20T04:04:58.568Z",
        "objectId": "xKtSvJpSDz",
        "updatedAt": "2015-09-20T04:05:11.827Z"
    },
	{
        "DREAM_MEANING": "A fence in a dream represents the same thing in your waking life, a barrier! Are you climbing over or hiding behind it? There is an obstacle in your path and you are either going to ignore it and excel or stand down and stay where you are. It could also mean that there is a barrier protecting you from harm or something or someone that is trying to bring you down. The fence is a symbol of getting away from the world and being in YOUR OWN WORLD away from everyone else.",
        "DREAM_TERM": "Fence",
        "createdAt": "2015-09-25T15:41:38.034Z",
        "objectId": "xLZ1AAt9H1",
        "updatedAt": "2015-09-25T15:53:13.358Z"
    },
	{
        "DREAM_MEANING": "When we see a mad dog in our dreams suggest that you are being ganged up by people who you thought where your good friends. People are verbally attacking you in your presence. Make sure you choose your friends wisely.\nIf your the one that kills the “Mad Dog” means that you will tackle and defeat an on going issue in your life that has been dragging on for too long.",
        "DREAM_TERM": "mad dog",
        "createdAt": "2015-09-19T23:53:49.437Z",
        "objectId": "xMVhcPF9Qk",
        "updatedAt": "2015-09-19T23:53:52.521Z"
    },
	{
        "DREAM_MEANING": "When you see lightning in a dream it symbolizes drastic change in things. If you are hit by lightning it indicates that you are going to be shaken by transformation in your life that is beyond your control.",
        "DREAM_TERM": "lightning",
        "createdAt": "2015-09-19T22:58:26.562Z",
        "objectId": "xQSgjeg5Of",
        "updatedAt": "2015-09-19T22:58:30.382Z"
    },
	{
        "DREAM_MEANING": "To dream that you are eating represents how you feel the world perceives you. Eating is a very important symbol that has many means depending on the context of the dream. To dream that you are enjoying your food suggests a positive coming of events that will keep you satisfied. To eat healthy foods such as salads means that you like to take care of your health and body. To dream that you have eaten to much suggests that you are over indulging in lifes pleasures. Dreaming of eating alone means that you are becoming greedy or feeling lonely and depressed as of late.",
        "DREAM_TERM": "Eating",
        "createdAt": "2015-09-25T15:31:25.832Z",
        "objectId": "xlxWnk1MWu",
        "updatedAt": "2015-09-25T15:32:24.859Z"
    },
	{
        "DREAM_MEANING": "Being paranoid in your dream represents how you feel in reality. You are worried about what you need to do in the future or how to deal with a situation. Perhaps you are feeling insecure in your current relationship?",
        "DREAM_TERM": "paranoia",
        "createdAt": "2015-09-20T00:17:41.902Z",
        "objectId": "xuDp4BBYAb",
        "updatedAt": "2015-09-20T00:17:43.652Z"
    },
	{
        "DREAM_MEANING": " This could be a build up of emotions that is ready to explode.  Who are you throwing the water balloon too?  That might give you an indication on who might be responsible for causing this distress.",
        "DREAM_TERM": "water balloon",
        "createdAt": "2015-09-20T04:03:58.475Z",
        "objectId": "xwf3ZkWJC0",
        "updatedAt": "2015-09-20T04:04:00.402Z"
    },
	{
        "DREAM_MEANING": "To dream of going bald has everything to do with appearance.  You may feel that you are getting to a stage of your life where your not as young as you used to be.  Is possible that you may be worried about people knowing whats on your mind.\nWhen your happy being bald in your dream, represents that your not afraid of being yourself. ",
        "DREAM_TERM": "baldness",
        "createdAt": "2015-09-19T07:01:04.031Z",
        "objectId": "y12EgqPO5K",
        "updatedAt": "2015-09-19T07:01:06.040Z"
    },
	{
        "DREAM_MEANING": "If you dream about putting gel in your hair it means that you are trying to hold things together in your life. You feel as if everything is falling apart but the gel symbolizes that things are going to be sorted out soon.",
        "DREAM_TERM": "Gel",
        "createdAt": "2015-09-25T15:42:12.673Z",
        "objectId": "yAWO0vmwFU",
        "updatedAt": "2015-09-25T15:59:03.534Z"
    },
	{
        "DREAM_MEANING": "When you dream of a lamp it indicates enlightenment and motivation",
        "DREAM_TERM": "lamp",
        "createdAt": "2015-09-19T22:55:48.225Z",
        "objectId": "yEhuqzQKsl",
        "updatedAt": "2015-09-19T22:55:51.988Z"
    },
	{
        "DREAM_MEANING": "Hair is a very important symbol because there are many states that your hair can be in and depending on the state is the way your waking life is at the moment. It represents your approach to whatever situations you are faced with which could pertain to sexuality or your wellbeing. If you are reaching towards someone elses hair it indicates your protective instincts or care for that person. It could also mean that you want to learn from someone in whatever particular aspect of your life.\n\nDreaming someone is trying to touch or smell your hair denotes your desire for sexual adventure. If you are trying to smell someones hair then the smell reminds you of someone.\n\nIf your hair is messy and full of knots then it means your life is in chaos at the moment due to your lack of organization of thoughts. Alternatively, when you dream that you have long hair, styling or playing with your hair implies that you are learning how to manage your thoughts. It could also mean that you are worried about your appearance.\n\nDreaming of your hair dropping indicates your worries about getting older, becoming unattractive and losing your sexual appeal. Some say hair is like a blanket to girls; it protects and makes them feel safe. Thus when it is dropping we feel weak and susceptible. On the other hand, if your hair is white it represents enlightenment; it could also have the same meaning of losing hair.\n\nIf you dream that you make an extreme change to your hairstyle, this is what it represents in your waking life. If the wind is passing through your hair then you are letting go releasing your emotions.",
        "DREAM_TERM": "Hair",
        "createdAt": "2015-09-25T15:42:48.424Z",
        "objectId": "yK5HtdzF7p",
        "updatedAt": "2015-09-25T16:04:45.574Z"
    },
	{
        "DREAM_MEANING": "Stop doubting yourself, the dream serves as a confirmation and push to do whatever you are unsure about.",
        "DREAM_TERM": "yes",
        "createdAt": "2015-09-20T04:10:58.073Z",
        "objectId": "yKdV9NMU77",
        "updatedAt": "2015-09-20T04:10:59.847Z"
    },
	{
        "DREAM_MEANING": "Dreaming of using a vacuum signifies that you feel something in missing in your life. You are trying to fill that void by sucking in outside resources. to feelings of emptiness. You may be experiencing a void in your life. On the other hand, the dream suggests that you need to clean up your act and get rid of the traits and behaviors that are giving you a demeaning character.",
        "DREAM_TERM": "vacuum",
        "createdAt": "2015-09-20T03:49:43.108Z",
        "objectId": "yUQerlRrZj",
        "updatedAt": "2015-09-20T03:49:45.033Z"
    },
	{
        "DREAM_MEANING": "A neck represents a connection between your intellectual (brain) and the corporeal (body) aspects. Discipline, certain physical limits and emotional restraints are necessary to keep a good balance.",
        "DREAM_TERM": "neck",
        "createdAt": "2015-09-20T00:03:55.447Z",
        "objectId": "yWcFtxYxSe",
        "updatedAt": "2015-09-20T00:03:57.379Z"
    },
	{
        "DREAM_MEANING": "Dreaming of a younger version of yourself indicates that you are missing those days. Perhaps you are dwelling in the past and wish you could make a fresh start. Otherwise, you have been acting immature lately and you need to learn to accept your responsibilities.\n",
        "DREAM_TERM": "young",
        "createdAt": "2015-09-20T04:11:49.058Z",
        "objectId": "yeO43MbrGs",
        "updatedAt": "2015-09-20T04:12:15.010Z"
    },
	{
        "DREAM_MEANING": "An epidemic in your dream represents your fear about a recent task. If you dream that you are causing the epidemic or involved in it you are afraid that your actions at the moment are going to hurt people. If you are not part of the epidemic and unaffected signifies your fear that the bad things in your life may become uncontrollable.",
        "DREAM_TERM": "Epidemic",
        "createdAt": "2015-09-25T15:38:00.545Z",
        "objectId": "yjNpL5s4Of",
        "updatedAt": "2015-09-25T15:47:14.372Z"
    },
	{
        "DREAM_MEANING": "Dancing in a dream is a celebration of independence, life and living in the present. Dreaming of dancing alone indicates you feel complete and free sometimes even in your sensuality and sexuality. If you are dancing with someone it represents your feelings of joyfulness and safety in a relationship whether it is companion or intimate.",
        "DREAM_TERM": "dancing",
        "createdAt": "2015-09-19T07:22:46.647Z",
        "objectId": "ymGsCNp8uQ",
        "updatedAt": "2015-09-19T07:23:19.564Z"
    },
	{
        "DREAM_MEANING": "A dream about neatness signifies your need to get rid of certain memories of the past to clear your head. Organization is crucial and a clear head is a good place to start.",
        "DREAM_TERM": "neat",
        "createdAt": "2015-09-20T00:03:32.232Z",
        "objectId": "yoTuFT7K7L",
        "updatedAt": "2015-09-20T00:03:36.619Z"
    },
	{
        "DREAM_MEANING": "Are you a gambler in your waking life? If not then to dream of gambling suggests that you be a bit more adventurous and take some chances in life. You only have one life to live so lighten up a bit and enjoy things without worrying too much about the consequences. If you are a gambler then your unconscious is telling you to slow down a bit and take a look at what you are doing, stop being so careless and letting your luck take you places in life. Eventually you would start gambling with your life.",
        "DREAM_TERM": "Gambling",
        "createdAt": "2015-09-25T15:41:41.439Z",
        "objectId": "z4nwh9v08b",
        "updatedAt": "2015-09-25T15:56:55.102Z"
    },
	{
        "DREAM_MEANING": " Depending if the window is open or closed changes what the meaning could imply.  If it is open it is considered a positive symbol that suggests freedom, choices and new opportunities.  If it is closed that it could mean you are closed minded or trapped in some aspect mentally.",
        "DREAM_TERM": "window",
        "createdAt": "2015-09-20T04:06:03.745Z",
        "objectId": "zXIKt0WFQW",
        "updatedAt": "2015-09-20T04:06:05.746Z"
    },
	{
        "DREAM_MEANING": "To see an orange tree in your dream, signifies health and prosperity. To dream that you are eating oranges, indicate satisfaction with your life and where you are at. You are in a good place. Alternatively, it means that you need to be reenergized.",
        "DREAM_TERM": "oranges",
        "createdAt": "2015-09-20T00:13:52.649Z",
        "objectId": "zaHQRfmLAM",
        "updatedAt": "2015-09-20T00:13:54.958Z"
    },
	{
        "DREAM_MEANING": "Seeing ying and yang in your dream represents your ability to find a way where two differences can operate together.",
        "DREAM_TERM": "yin yang",
        "createdAt": "2015-09-20T04:11:25.486Z",
        "objectId": "zjDMNtCoid",
        "updatedAt": "2015-09-20T04:11:27.510Z"
    },
	{
        "AUTHOR": "Michael",
        "DREAM_MEANING": " In our dream world an abyss is an important symbol that we should forget about.  An abyss is the dark and scary part of your unconscious that you are starting to explore.  Are you scared or excited in your dream?  This will help you determine if your scared or wanting to explore the depths of your mind.",
        "DREAM_TERM": "abyss",
        "createdAt": "2015-09-19T06:36:57.383Z",
        "objectId": "zoPhdW58c5",
        "updatedAt": "2015-09-19T06:38:55.391Z"
    },
	{
        "DREAM_MEANING": "Whats cooking? A dream of a kitchen represents motherly feelings.If you cannot complete the meal, the dream is a metaphor of not being able to handle the heat and you need to get out of a situation. On the other hand cooking in the kitchen indicates changes in your life.",
        "DREAM_TERM": "kitchen",
        "createdAt": "2015-09-19T22:52:13.118Z",
        "objectId": "zxp883Y2lH",
        "updatedAt": "2015-09-19T22:52:15.248Z"
    }
] }